{
  "backend/main.mo": "Main Motoko actor for the QuickBee backend defining all data types (UserProfile, Service, Lead, Project, Order, CRM, etc.) and including mixins for authorization, blob storage, and Stripe/HTTP outcall integrations.",
  "feature_evidence.json": "Feature evidence report mapping the AutomationPage toggle persistence feature (REQ-77) to its affected file and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend architecture.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH CSS custom properties for the design system's color tokens in both light and dark modes, including sidebar, chart, and semantic UI colors.",
  "frontend/index.html": "HTML entry point for the Quick Bee Agency app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "TanStack Router app root that registers all page routes under an authenticated layout, wraps the app in QueryClient/ThemeProvider/AIConfigProvider/WebhookLogProvider, and redirects the root path directly to the dashboard.",
  "frontend/src/auth/demoCredentials.ts": "Empty file intended to export demo credential objects and the DemoRole type for admin and manager roles.",
  "frontend/src/auth/useSession.ts": "Empty file intended to provide a session management hook for storing and retrieving session data from sessionStorage.",
  "frontend/src/cart/useCart.ts": "React hook managing a localStorage-persisted shopping cart with add, remove, update quantity, and clear operations, plus derived total and item count values.",
  "frontend/src/components/analytics/AnalyticsMetricsCard.tsx": "Displays a responsive grid of five analytics KPI cards (users, sessions, bounce rate, traffic source, conversion rate) with icons and descriptions.",
  "frontend/src/components/analytics/GrowthSummaryPanel.tsx": "Card component showing four growth summary sections (trends, drop-off insights, funnel suggestions, SEO tips) with placeholder text when no live analytics data is connected.",
  "frontend/src/components/automation/SalesSystemConfigDialog.tsx": "A dialog component for configuring a sales system's API endpoint and key, with connection testing, credential persistence via backend hooks, and save/cancel actions.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Displays a full-screen error card for bootstrap failures, showing timeout or connection error messaging with retry and reload buttons.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "A passthrough gate component that renders its children immediately without any auth or actor checks.",
  "frontend/src/components/content/ContentSectionCard.tsx": "A card component that displays a titled content section with a copy-to-clipboard button and scrollable monospace text area.",
  "frontend/src/components/generators/AICredentialBanner.tsx": "An alert banner that warns users when AI credentials are not configured, with a link to open settings and a dismiss button.",
  "frontend/src/components/layout/AppShell.tsx": "The main application layout shell that composes the sidebar navigation, top navigation bar, and a scrollable main content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "A collapsible sidebar navigation component that renders grouped nav items with icons and highlights the active route.",
  "frontend/src/components/layout/TopNav.tsx": "A top navigation bar with a search input, a notification popover showing unread counts, and a settings button.",
  "frontend/src/components/leads/AutomationLogsPanel.tsx": "A slide-out sheet panel that displays filterable automation event logs for a lead or globally, with CSV export functionality.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Renders a toolbar for bulk lead actions (change status, export, delete) showing the count of selected leads and a clear selection button.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "Dialog that allows bulk updating the status of multiple selected leads, iterating through each and calling the updateLead mutation with success/failure toasts.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "Dialog for editing a payment link's URL and QR code, supporting QR generation via an external API or file upload, and saving changes via mutation hooks.",
  "frontend/src/components/leads/IntegrationConfigDialog.tsx": "Dialog for configuring third-party integration credentials (WhatsApp, Airtable, Google Sheets, Resend, Razorpay) with dynamic fields per integration and a save callback.",
  "frontend/src/components/leads/IntegrationPanel.tsx": "Side sheet panel listing available integrations with toggle switches to enable/disable automations and a settings button to open the IntegrationConfigDialog for each.",
  "frontend/src/components/leads/LeadDetailPanel.tsx": "Side sheet displaying full lead details including contact info, status, qualification score, and a GST quote calculator that saves updates via the updateLead mutation.",
  "frontend/src/components/leads/LeadExportToolbar.tsx": "Toolbar with buttons to export all leads or only selected leads to CSV, and to download a PDF report of all leads.",
  "frontend/src/components/leads/LeadFilterPanel.tsx": "A filter panel component for leads that provides search input, status/channel dropdowns, and a score range slider, with a clear-all option when filters are active.",
  "frontend/src/components/leads/LeadTableView.tsx": "A sortable, selectable table view for leads that displays lead details with inline status editing, color-coded status badges, and qualification scores.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "A dialog that displays a generated payment link with copy-to-clipboard, QR code download, and edit functionality via a nested EditPaymentLinkDialog.",
  "frontend/src/components/leads/QualificationBadge.tsx": "A small badge component that displays a lead's qualification tier (Qualified/Hot/Warm/Cold) with corresponding icons and color styles based on a numeric score.",
  "frontend/src/components/services/BuyNowButton.tsx": "A reusable button component that triggers a buy-now action for a service item, showing a loading spinner while processing.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "A multi-tab dialog form for creating a new service with fields for name, description, category, three pricing tiers with features, and visibility settings.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "A confirmation dialog for deleting a service, showing the service name and calling the delete mutation with a loading state on the confirm button.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "A dialog component for editing all service details including name, description, category, tiered pricing (basic/pro/premium), features, and settings like visibility and availability. Syncs form state with the provided service prop and submits updates via the `useUpdateService` mutation hook.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "A dialog for editing a service's payment information, allowing users to set a custom payment URL, generate a QR code from that URL via an external API, or upload a custom QR code image. Saves changes using the `useUpdateServicePaymentInfo` mutation hook.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "A read-only card component that displays a service's payment link (with a copy button) and QR code (with a download button), rendering nothing if neither is available.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "A dialog for configuring Razorpay payment settings on a specific service, including enabling/disabling Razorpay and setting a Key ID and Order ID. Persists changes via the `useUpdateServiceRazorpay` mutation hook.",
  "frontend/src/components/services/TierSelector.tsx": "A small presentational component that renders a row of clickable tier buttons (e.g., Basic, Pro, Premium), each displaying the tier name and formatted price, with the selected tier visually highlighted.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A settings panel card for configuring global Razorpay credentials (API Key, API Secret, Webhook Secret), showing the current configuration status and allowing secrets to be toggled visible. Saves configuration via the `useSetRazorpayConfiguration` mutation hook.",
  "frontend/src/components/workflows/WorkflowCard.tsx": "A card component that displays a workflow's name, description, trigger, and active status badge, along with a Run button and the last execution result summary. Delegates detailed result rendering to the `WorkflowResultDisplay` component.",
  "frontend/src/components/workflows/WorkflowResultDisplay.tsx": "A React component that displays the result of a workflow execution, showing status (success/error/pending), a message, data-logging badge, and optional next steps list.",
  "frontend/src/contexts/AIConfigContext.tsx": "Provides a React context for managing and persisting AI/webhook configuration (API keys, WhatsApp, Razorpay, email, CRM, automation toggles, Calendly) in localStorage, with helpers for testing connections and checking field configuration.",
  "frontend/src/contexts/WebhookLogContext.tsx": "Provides a React context for storing and managing webhook log entries (up to 500) in sessionStorage, exposing addLog and clearLogs actions.",
  "frontend/src/data/agencyPlans.ts": "Defines and exports three tiered agency plans (Spark, Surge, Titan) with pricing, target audience, descriptions, and feature lists for the agency's service offerings.",
  "frontend/src/data/individualPackages.ts": "Defines and exports an array of individual service packages (e.g., website development, sales funnel, WhatsApp automation) each with an ID, price in INR, category, description, and feature list.",
  "frontend/src/data/maintenancePlans.ts": "Defines and exports categorized maintenance plan data (website, app, AI automation, marketing) with tiered pricing ranges and feature lists, plus a price-formatting utility.",
  "frontend/src/data/masterServiceCatalog.ts": "Defines the master service catalog with category metadata and detailed service entries (web development and others) including multi-tier INR pricing and feature lists for all agency offerings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAIContentGeneration.ts": "Custom hook that sends a prompt to a configured AI API endpoint (OpenAI-compatible) and returns the generated content, logging requests and optionally posting results to an automation webhook.",
  "frontend/src/hooks/useAutomationTriggers.ts": "Custom hook providing trigger functions for WhatsApp auto-reply, proposal auto-send, and lead follow-up automations, each posting payloads to a configured webhook URL if the respective feature is enabled.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Simple hook that sets a timeout flag after a configurable delay, useful for detecting when app bootstrap has taken too long.",
  "frontend/src/hooks/useDirectPurchase.ts": "Hook that adds an item directly to the cart and navigates to the checkout page, with loading state and error toast handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useLeadFollowUpTrigger.ts": "Thin wrapper hook around useAutomationTriggers that exposes a simplified function to trigger a lead follow-up by lead ID and data.",
  "frontend/src/hooks/useMeetingSchedulingWorkflow.ts": "Hook that generates a Calendly meeting link, copies it to the clipboard, optionally posts a webhook event, and returns a workflow result with next steps.",
  "frontend/src/hooks/useNewLeadSubmissionWorkflow.ts": "Hook that submits new lead data to CRM and automation webhooks if configured, saves the workflow execution, and returns a standardized result.",
  "frontend/src/hooks/usePaymentProcessingWorkflow.ts": "Hook providing payment success and failure trigger functions that post events to an automation webhook, generate invoice references, and return structured workflow results.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend actor calls, including CRUD operations for user profiles, leads, orders, projects, services, payments, and other entities. Each hook wraps useQuery or useMutation with actor availability checks and cache invalidation.",
  "frontend/src/hooks/useWebhookPost.ts": "A useMutation hook that POSTs a tool name and form data to a configured webhook URL, attaching an optional Bearer token and logging each request/response via WebhookLogContext.",
  "frontend/src/hooks/useWorkflowExecution.ts": "Provides utilities and a hook for running async workflow functions, tracking running state and results, persisting executions to localStorage, and posting payloads to webhooks with structured logging.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, sets up Tailwind base/components/utilities, and defines CSS custom properties for a dark-themed design system including gold accent colors, sidebar variables, and utility classes like gold-glow and card-glass.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider, InternetIdentityProvider, and the root App component into the DOM.",
  "frontend/src/marketplace/servicesCatalog.ts": "Exports a static array of 30 catalog service objects, each with a name and description, covering digital marketing, development, and business consulting offerings.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that displays summary stats (revenue, active leads, projects, orders) fetched via React Query hooks and provides navigation cards to the Leads and Analytics pages.",
  "frontend/src/pages/AnalyticsEnginePage.tsx": "A page that lets non-guest users run an analytics engine workflow over a date range, displaying metrics and growth summaries either from simulated data or a configured automation webhook. Results are saved as workflow executions and displayed via WorkflowResultDisplay.",
  "frontend/src/pages/AnalyticsPage.tsx": "A dashboard page showing KPI cards (revenue, clients, conversion rate, top service) and charts (bar, line, pie) built with Recharts using real leads/orders/services data mixed with mock monthly revenue data.",
  "frontend/src/pages/AutomationPage.tsx": "A page listing five automation toggles (WhatsApp auto-reply, proposal auto-send, lead follow-up, payment confirmation, project onboarding) driven by AIConfigContext, with a badge showing how many are active and a link to configuration settings.",
  "frontend/src/pages/CartPage.tsx": "A shopping cart page that displays cart items with quantity controls and removal, calculates subtotal plus 18% GST, and provides an order summary with a checkout button; shows an empty-state prompt when the cart is empty.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders a checkout page with order summary, GST calculation, and payment method selection (Stripe or Razorpay), initiating a Stripe checkout session on submission.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Displays a client portal dashboard with navigation cards for Projects, Services, Payments, and Profile, along with user role badge and logout functionality.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Placeholder page for client onboarding that displays a card with a message indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/ClosingScriptsPage.tsx": "AI-powered sales closing script generator that takes prospect details and objection type, then produces three tailored closing scripts via an API or webhook.",
  "frontend/src/pages/ContentCreatorPage.tsx": "AI content generation page that accepts a keyword and produces structured content including blog posts, social captions, LinkedIn posts, and Instagram carousel outlines.",
  "frontend/src/pages/CRMPage.tsx": "A Kanban-style CRM board that groups CRM activities into six pipeline stages (New Lead through Lost), rendering each activity as a card with an icon, notes, and creator info, with skeleton loading states.",
  "frontend/src/pages/DashboardPage.tsx": "Admin/member dashboard showing KPI cards (revenue, leads, projects, paid orders) and quick-action buttons for navigating to key CRM and analytics sections.",
  "frontend/src/pages/DataExportCenterPage.tsx": "Data export center that fetches records from the backend for modules like leads, invoices, and payments, then downloads them as CSV or JSON files.",
  "frontend/src/pages/FollowUpMessagesPage.tsx": "A page that generates a 5-message follow-up sequence for a sales lead using an AI API, with inputs for lead name, pipeline stage, last interaction, and follow-up goal. Supports webhook posting, clipboard copy, and text export of the generated messages.",
  "frontend/src/pages/GeneratorsPage.tsx": "A hub page displaying a grid of six AI-powered sales tools (service recommender, proposal generator, pricing strategy, closing scripts, follow-up messages, lead qualification) as clickable cards that navigate to their respective routes.",
  "frontend/src/pages/InvoiceHistoryPage.tsx": "Displays a searchable list of invoices fetched from the backend (all invoices for admins, own invoices for users) with options to download individual invoices as text or export all as CSV, JSON, or ZIP.",
  "frontend/src/pages/LandingPage.tsx": "An empty landing page file with no content or exports.",
  "frontend/src/pages/LeadQualificationPage.tsx": "A page that scores and qualifies a sales lead using the BANT framework via an AI API, taking inputs like company size, budget, urgency, and needs description, then displaying a tier (Hot/Warm/Cold), score, strengths, risks, and next steps.",
  "frontend/src/pages/LeadsPage.tsx": "A full-featured leads management page supporting list/grid views, filtering, sorting, creating and deleting leads, payment link generation, automation logs, and integration panels, with data fetched from the backend via custom query hooks.",
  "frontend/src/pages/LegalPage.tsx": "Displays a grid of six required legal document cards (Privacy Policy, Terms & Conditions, etc.) fetched from the backend, showing a preview of each or a placeholder if not yet created.",
  "frontend/src/pages/LoginPage.tsx": "A minimal login page that immediately redirects the user to the authenticated dashboard on mount, rendering nothing.",
  "frontend/src/pages/ManagerDashboardPage.tsx": "Displays a manager's dashboard with lead statistics (total, active, closed) and navigation cards to leads and CRM sections, with logout functionality.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a tabbed notifications page with unread/read lists, supports marking notifications as read and navigating to relevant pages based on notification type.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Renders a payment failure screen that triggers a failure workflow on mount and provides options to retry payment or return to the dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays an admin payments page with revenue stats and tabbed views for orders and payment links, including status indicators and update actions.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Renders a payment success screen that triggers a success workflow on mount, displays an invoice reference, and links to projects or dashboard.",
  "frontend/src/pages/PricingStrategyPage.tsx": "Provides a pricing strategy tool where users input service details, urgency, complexity, and add-ons to calculate a price, with optional AI suggestions via webhook or API.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays detailed information for a single project (ID, status, service ID, start time) fetched by project ID from the route params.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects belonging to the authenticated user in a responsive card grid, showing status badges, service names, and start dates with loading skeletons.",
  "frontend/src/pages/ProposalGeneratorPage.tsx": "AI-powered proposal generator that collects client/project details, posts to a webhook and/or OpenAI-compatible API, and renders a structured proposal with export-to-text functionality.",
  "frontend/src/pages/SalesSystemConfigPage.tsx": "Configuration page for managing integration credentials (AI API, WhatsApp, Razorpay, email, webhooks, Calendly) with per-field enable toggles, secret masking, connection testing, and save functionality.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows full details of a single service including description, features, and three pricing tiers (Basic, Pro, Premium) with add-to-cart buttons for each tier.",
  "frontend/src/pages/ServiceRecommendationPage.tsx": "AI-driven service recommendation tool where users select business types, goals, budget, and team size, then receive a recommended service with ROI projection via webhook or OpenAI API call.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a catalog of tiered digital marketing and agency services with search, filtering, and cart functionality, rendering prices in INR across Basic/Pro/Premium tiers.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page that renders the Razorpay configuration panel and a placeholder card for future Stripe configuration.",
  "frontend/src/pages/WebhookLogsPage.tsx": "Displays filterable webhook/API call logs with search, status and event-type filters, success/error stats, and a confirmation dialog to clear all logs.",
  "frontend/src/pages/WhatsAppLogsPage.tsx": "Fetches and displays WhatsApp message delivery logs from the backend with search/type filtering and export options for CSV, JSON, and a monthly report.",
  "frontend/src/pages/WorkflowsPage.tsx": "Renders a list of automation workflow cards (lead submission, meeting scheduling, payment processing, etc.) that can be manually triggered, with execution state persisted to localStorage.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that calls the backend actor to create a Stripe checkout session and returns the session ID and redirect URL.",
  "frontend/src/utils/exportContent.ts": "Utility that serializes AI-generated content (blog, social captions, LinkedIn, Instagram) into a formatted plain-text file and triggers a browser download.",
  "frontend/src/utils/exportUtils.ts": "Collection of export utilities for leads, invoices, WhatsApp logs, and automation logs supporting CSV, JSON, and print-to-PDF formats with CSV escaping helpers.",
  "frontend/src/utils/formatCurrency.ts": "Provides helper functions to format numbers as Indian Rupee currency strings, including a price-range formatter for monthly pricing display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, color palettes (gold, charcoal, sidebar, semantic colors), border radii, shadows, gradients, and keyframe animations for the frontend.",
  "project_state.json": "Project state snapshot (version 27) describing the Quick Bee AI Growth Engine platform's architecture, existing features, known issues, and multi-step build plan including CRM, automation dashboard, and webhook-based integrations."
}