{
  "backend/main.mo": "Main Motoko actor for the Quick Bee Agency backend, defining all core data types (User, Service, Project, Order, Lead, CRM, etc.) and including mixins for authorization, blob storage, and Stripe/HTTP integrations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (services catalog population, individual packages, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of every frontend source file, serving as a human-readable index of the frontend codebase's structure and responsibilities.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for the full design token system (colors, borders, sidebar, charts) in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the Quick Bee Agency React app, setting the page title, favicon, and mounting the root div with the main.tsx module script.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with all authenticated and public routes, wraps the app in QueryClientProvider, ThemeProvider, AIConfigProvider, and WebhookLogProvider.",
  "frontend/src/auth/demoCredentials.ts": "Empty file intended to export demo credential objects for Admin and Manager roles.",
  "frontend/src/auth/useSession.ts": "Empty file intended to provide a session management hook for storing and retrieving user session data.",
  "frontend/src/cart/useCart.ts": "React hook managing shopping cart state with localStorage persistence, supporting add, remove, update quantity, and clear operations on typed CartItem objects.",
  "frontend/src/components/automation/SalesSystemConfigDialog.tsx": "A dialog component for configuring a sales system's API endpoint and key, with connection testing and save functionality backed by React Query hooks.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Displays an error card when the app fails to initialize, showing timeout or connection error messaging with retry and reload actions.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "A gate component that blocks rendering children until the actor and identity are ready, showing a phased loading spinner or an error panel on timeout.",
  "frontend/src/components/generators/AICredentialBanner.tsx": "An alert banner that warns users when AI credentials are not configured, with a button to open settings and a dismiss option.",
  "frontend/src/components/layout/AppShell.tsx": "The main layout shell that composes the sidebar, top navigation, and scrollable main content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "A collapsible sidebar navigation component with grouped nav items, role-based visibility, and active route highlighting.",
  "frontend/src/components/layout/TopNav.tsx": "The top navigation bar featuring a search input, a notification popover with unread count, and user profile/role display.",
  "frontend/src/components/leads/AutomationLogsPanel.tsx": "A slide-out Sheet panel that displays automation event logs, supporting filtering by lead ID and search by event type/status, with CSV export functionality.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "A toolbar component shown when leads are selected, providing bulk actions for exporting, deleting, changing status, and clearing the selection.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "A dialog that allows users to update the status of multiple selected leads at once, iterating through each lead and calling the update mutation.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "A dialog for editing a payment link's custom URL and QR code, supporting QR code generation via an external API or manual image upload.",
  "frontend/src/components/leads/IntegrationConfigDialog.tsx": "A dialog for configuring API credentials for specific integrations (WhatsApp, Airtable, Google Sheets, Resend, Razorpay) with per-integration field definitions.",
  "frontend/src/components/leads/IntegrationPanel.tsx": "A slide-out Sheet panel listing available integrations with toggle switches to enable/disable each and a settings button to open the IntegrationConfigDialog for credential configuration.",
  "frontend/src/components/leads/LeadDetailPanel.tsx": "A slide-out Sheet panel displaying full lead details including contact info, qualification score, and a GST quote calculator with save functionality.",
  "frontend/src/components/leads/LeadExportToolbar.tsx": "A toolbar component providing buttons to export all leads or selected leads to CSV, and all leads to a PDF report.",
  "frontend/src/components/leads/LeadFilterPanel.tsx": "A filter panel with search, status, channel, and qualification score range controls for filtering the leads list.",
  "frontend/src/components/leads/LeadTableView.tsx": "A sortable, selectable table view of leads with inline status editing, qualification badges, and click-to-open detail support.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "A dialog that displays a generated Razorpay payment link with copy, QR code download, open-in-browser, and edit actions.",
  "frontend/src/components/leads/QualificationBadge.tsx": "A small badge component that displays a lead's qualification tier (Cold/Warm/Hot/Qualified) with an icon and optional numeric score.",
  "frontend/src/components/services/BuyNowButton.tsx": "A reusable button component that triggers a buy-now callback for a given service item, showing a loading spinner while processing.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "A multi-tab dialog form for creating a new service with name, description, category, three pricing tiers with features, and visibility settings.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "A confirmation dialog component for deleting a service, showing the service name and using the `useDeleteService` mutation hook to perform the deletion.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "A multi-tab dialog for editing all service fields including name, description, pricing tiers, features, and settings, using the `useUpdateService` mutation hook to persist changes.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "A dialog for editing a service's payment link URL and QR code, supporting QR generation via an external API or file upload, and saving via `useUpdateServicePaymentInfo`.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "A read-only card component that displays a service's payment link (with copy button) and QR code (with download button), rendering nothing if neither is available.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "A dialog for configuring per-service Razorpay settings including enabling the integration, Key ID, and Order ID, saved via the `useUpdateServiceRazorpay` mutation hook.",
  "frontend/src/components/services/TierSelector.tsx": "A small UI component that renders a row of selectable pricing tier buttons, highlighting the active tier and displaying its formatted INR price.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A settings card for entering and saving global Razorpay API credentials (key, secret, webhook secret), with a toggle to show/hide secrets and a configured/not-configured status indicator.",
  "frontend/src/contexts/AIConfigContext.tsx": "Provides a React context for managing webhook/API configuration state, including connection statuses and automation toggles, with persistence via localStorage.",
  "frontend/src/contexts/WebhookLogContext.tsx": "Provides a React context for storing and querying webhook log entries, with session-based persistence and filtering by event type or success/error status.",
  "frontend/src/data/agencyPlans.ts": "Defines and exports three agency pricing plans (Spark, Surge, Titan) with price ranges, target audiences, features, and badge colors.",
  "frontend/src/data/individualPackages.ts": "Defines and exports a catalog of individual service packages (e.g., website, SEO, chatbot) with fixed INR prices, categories, and feature lists.",
  "frontend/src/data/maintenancePlans.ts": "Defines and exports tiered maintenance plan categories (website, app, AI automation, marketing) with price ranges and included features per tier.",
  "frontend/src/data/masterServiceCatalog.ts": "Defines a comprehensive master service catalog with category metadata and multi-tier pricing for services across web development, AI, marketing, and other categories.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAutomationTriggers.ts": "Custom hook that provides functions to trigger various automation webhooks (WhatsApp auto-reply, proposal send, lead follow-up, payment confirmation, project onboarding) by POSTing to a configured webhook URL and logging each attempt.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Custom hook that sets a timeout flag after a configurable delay (default 5 seconds), useful for detecting when app bootstrapping has stalled.",
  "frontend/src/hooks/useDirectPurchase.ts": "Custom hook that adds an item directly to the cart and navigates to the checkout page, with loading state and toast notifications for success or failure.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook for ICP, managing AuthClient creation, login/logout flow, identity persistence, and exposing login status states.",
  "frontend/src/hooks/useLeadFollowUpTrigger.ts": "Thin wrapper hook around useAutomationTriggers that exposes a single function to trigger a lead follow-up automation webhook for a given lead.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data, covering user profiles, roles, integration settings, sales config, and numerous CRM/business entities via an actor.",
  "frontend/src/hooks/useWebhookPost.ts": "Custom hook using React Query's useMutation to POST tool form data to a configured webhook URL, logging each request and its result to the webhook log context.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines CSS custom properties for light and dark theme design tokens including colors, sidebar, and chart variables.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/marketplace/servicesCatalog.ts": "Defines a CatalogService interface and exports an array of 30 predefined marketplace services, each with a name and description.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that displays key stats (revenue, leads, projects, orders) using data from query hooks, with navigation to management sections and a logout button.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics page showing KPI cards and charts (bar, line, pie) for revenue, active clients, conversion rate, and lead status using Recharts with mostly mock data.",
  "frontend/src/pages/AutomationPage.tsx": "Automation settings page that lets users toggle various workflow automations (WhatsApp auto-reply, proposal sending, lead follow-up, etc.) with webhook configuration status indicators.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that lists cart items with quantity controls and removal, and shows an order summary with subtotal, 18% GST, and final total.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders the checkout page with order summary, GST calculation, and payment method selection (Stripe or Razorpay), redirecting to Stripe's hosted checkout session on confirmation.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Displays the client portal dashboard with navigation cards for Projects, Services, Payments, and Profile, along with user role badge and logout functionality.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Placeholder page for client onboarding that displays a card with a message indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/ClosingScriptsPage.tsx": "AI-powered sales tool that generates three tailored closing scripts based on prospect name, industry, and objection, with support for webhook posting and direct API calls, plus copy/export functionality.",
  "frontend/src/pages/CRMPage.tsx": "Kanban-style CRM board that displays CRM activities grouped by pipeline stage (New Lead through Lost) with color-coded columns and activity type icons.",
  "frontend/src/pages/DashboardPage.tsx": "Admin/member dashboard showing KPI cards (revenue, leads, projects, paid orders) computed from live data, plus quick-action buttons for navigating to key sections of the app.",
  "frontend/src/pages/DataExportCenterPage.tsx": "Admin-only page that allows exporting various data modules (leads, invoices, payments, etc.) in CSV or JSON format by calling backend actor methods directly.",
  "frontend/src/pages/FollowUpMessagesPage.tsx": "AI-powered sales tool that generates a 5-message follow-up sequence tailored to a lead's pipeline stage and goal, with webhook integration and copy/export support.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays a grid of AI-powered sales tool cards (proposal generator, pricing strategy, closing scripts, etc.) with navigation to each tool's dedicated route.",
  "frontend/src/pages/InvoiceHistoryPage.tsx": "Shows a searchable list of invoices fetched from the backend and provides download options for individual invoices (text) and bulk exports (CSV, JSON).",
  "frontend/src/pages/LandingPage.tsx": "Empty landing page file with no content or exports.",
  "frontend/src/pages/LeadQualificationPage.tsx": "Form-based page that collects lead details (company size, budget, urgency, etc.) and uses an AI API to return a BANT-scored qualification result with tier, strengths, risks, and next steps.",
  "frontend/src/pages/LeadsPage.tsx": "Full leads management page supporting list/grid views, filtering, sorting, lead creation via dialog, deletion, payment link generation, and integration/automation log panels.",
  "frontend/src/pages/LegalPage.tsx": "Displays a grid of required legal document cards (Privacy Policy, Terms, etc.) fetched from the backend, showing content or a placeholder if not yet created.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity authentication and redirects authenticated users to the app, prompting new users with a profile setup dialog before proceeding.",
  "frontend/src/pages/ManagerDashboardPage.tsx": "Displays a manager's dashboard with lead stats (total, active, closed) fetched via React Query hooks, and navigation cards to leads and CRM sections, with a logout button.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a tabbed notifications page with unread/read lists, supports marking notifications as read and navigating to relevant pages based on notification type.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Static page displayed after a failed payment, offering buttons to return to the cart or navigate to the dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Admin payments page showing revenue stats, a tabbed view of orders and payment links fetched from the backend, with status icons and styling.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displayed after a successful payment; clears the cart on mount and provides navigation to projects or the dashboard.",
  "frontend/src/pages/PricingStrategyPage.tsx": "Interactive pricing calculator that computes service prices based on base cost, urgency, complexity, and add-ons, with optional AI suggestions via webhook or API and CSV export.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays detailed information for a single project (ID, status, service ID, start date) fetched by project ID from the route params.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays a grid of the authenticated user's projects fetched by client principal, showing project ID, status, associated service name, and start date with loading skeletons.",
  "frontend/src/pages/ProposalGeneratorPage.tsx": "AI-powered proposal generator that collects client/project details, posts to a webhook and/or OpenAI-compatible API, and renders a structured proposal with export functionality.",
  "frontend/src/pages/SalesSystemConfigPage.tsx": "Configuration page for managing and testing multiple integration credentials (webhooks, API keys, WhatsApp, Razorpay, email) with per-field enable toggles, secret masking, and connection status badges.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed information for a single service including description, features, and three pricing tiers (Basic/Pro/Premium), with add-to-cart buttons for each tier.",
  "frontend/src/pages/ServiceRecommendationPage.tsx": "AI-driven service recommendation tool where users select business types, goals, budget, and team size, then receives a recommended service with ROI projection via webhook or OpenAI API.",
  "frontend/src/pages/ServicesPage.tsx": "Full services catalog page with tabbed views for master services, individual packages, maintenance plans, and agency plans, supporting search, category filtering, tier selection, and admin CRUD dialogs.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that renders the Razorpay configuration panel and a placeholder Stripe configuration card, with an access-denied view for non-admins.",
  "frontend/src/pages/WebhookLogsPage.tsx": "Displays a filterable, searchable table of outgoing webhook log entries with status badges and a confirmation dialog to clear all logs.",
  "frontend/src/pages/WhatsAppLogsPage.tsx": "Shows WhatsApp message delivery logs fetched from the backend with search/filter controls and export options for CSV, JSON, and a monthly report.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that calls the backend actor to create a Stripe checkout session and returns the session ID and redirect URL.",
  "frontend/src/utils/exportUtils.ts": "Utility functions for exporting leads, invoices, and automation logs to CSV, JSON, and HTML-based PDF formats, including a qualification tier helper.",
  "frontend/src/utils/formatCurrency.ts": "Provides helpers to format numbers as Indian Rupee currency strings and as a monthly price range.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both regular and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based semantic color tokens, custom fonts, border radii, shadows, and background gradients.",
  "project_state.json": "Tracks the overall project state (version 9) for an AI agency platform with CRM, automation dashboard, webhook engine, and various API integrations. Documents existing features, known issues, and architectural notes about webhook-based external automation."
}