{
  "backend/main.mo": "Main Motoko actor defining all backend types (User, Service, Project, Lead, Order, CRM, etc.) and including mixins for authorization, blob storage, and Stripe/HTTP outcall integrations for a full-stack agency management platform.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend architecture.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, sidebar, charts, and UI components.",
  "frontend/index.html": "HTML entry point for the Quick Bee Agency app, mounting the React app at #root and loading the main TSX module.",
  "frontend/src/App.tsx": "Main React app file configuring TanStack Router with all application routes including login, role-specific dashboards, authenticated shell routes, and payment pages, wrapped in QueryClientProvider and ThemeProvider.",
  "frontend/src/auth/demoCredentials.ts": "Empty file intended to export demo credential objects for admin and manager roles.",
  "frontend/src/auth/useSession.ts": "Empty file intended to provide session management hooks for storing and retrieving user session data.",
  "frontend/src/cart/useCart.ts": "React hook managing a shopping cart with localStorage persistence, supporting add, remove, update quantity, and clear operations with BigInt service IDs.",
  "frontend/src/components/automation/SalesSystemConfigDialog.tsx": "Dialog component for configuring AI sales system API credentials, with connection testing, backend persistence via React Query mutations, and show/hide API key toggle.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Displays an error card when the app fails to initialize, showing either a timeout or connection failure message with troubleshooting tips and retry/reload buttons.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "Guards the app by showing a phased loading spinner until the actor and identity are ready, and renders a BootstrapErrorPanel if initialization times out.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout component that composes SidebarNav, TopNav, and a scrollable main content area into a full-screen shell.",
  "frontend/src/components/layout/SidebarNav.tsx": "Collapsible sidebar navigation with grouped nav items, role-based visibility, active route highlighting, and a logout handler.",
  "frontend/src/components/layout/TopNav.tsx": "Top header bar with a search input, a notification bell popover showing unread count, and a user profile/role display.",
  "frontend/src/components/leads/AutomationLogsPanel.tsx": "A slide-out sheet panel that displays filterable automation event logs for a specific lead or all leads, with CSV export support.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Toolbar shown when leads are selected in bulk, providing actions to change status, export, delete, or clear the selection.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "A dialog component that allows users to change the status of multiple selected leads at once, iterating through each lead and calling the update mutation, then reporting success/failure counts via toast notifications.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "A dialog for editing a payment link's URL and QR code, supporting QR code generation via an external API or file upload, and saving changes through dedicated mutation hooks.",
  "frontend/src/components/leads/IntegrationConfigDialog.tsx": "A dialog that renders integration-specific credential input fields (for WhatsApp, Airtable, Google Sheets, Resend, Razorpay) and calls a provided onSave callback with the entered configuration values.",
  "frontend/src/components/leads/IntegrationPanel.tsx": "A slide-out sheet panel listing available integrations (WhatsApp, Razorpay, Airtable, etc.) with toggles to enable/disable each and a settings button to open the IntegrationConfigDialog for credential configuration.",
  "frontend/src/components/leads/LeadDetailPanel.tsx": "A slide-out sheet that displays detailed information for a selected lead including contact info, status, qualification score, and a GST quote calculator with configurable base amount and tax rate.",
  "frontend/src/components/leads/LeadExportToolbar.tsx": "A toolbar component providing buttons to export all leads or only selected leads to CSV, and all leads to a PDF report, using utility functions with timestamped filenames.",
  "frontend/src/components/leads/LeadFilterPanel.tsx": "A filter panel component for leads that provides search, status, channel, and score range filters with a clear-all option.",
  "frontend/src/components/leads/LeadTableView.tsx": "A sortable, selectable table view for leads with inline status editing, qualification badges, and formatted date display.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "A dialog that displays a generated payment link with copy, QR code download, and edit capabilities via an embedded edit dialog.",
  "frontend/src/components/leads/QualificationBadge.tsx": "A badge component that displays a lead's qualification tier (Qualified/Hot/Warm/Cold) with corresponding icons and color styles.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "A dialog form for creating a new service with tabbed pricing tiers (Basic/Pro/Premium), features, and visibility settings.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "A confirmation dialog for deleting a service, showing the service name and handling the delete mutation with loading state.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "A dialog for editing an existing service's details, pricing tiers, features, and settings, pre-populated from the service object.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "A dialog component for editing a service's payment information, allowing users to enter a custom payment URL, generate a QR code via an external API, or upload a custom QR code image, then save the data via a mutation hook.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "A read-only card component that displays a service's payment link (with copy button) and QR code (with download button), rendering nothing if neither is provided.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "A dialog component for configuring Razorpay payment settings on a service, including enabling/disabling Razorpay and setting a Key ID and optional Order ID, saved via a mutation hook.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A settings panel card for entering and saving global Razorpay API credentials (key, secret, webhook secret), with a toggle to show/hide secrets and a configured/not-configured status indicator.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control with an admin token and invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "A simple hook that sets a timeout flag after a configurable delay (default 5 seconds), useful for detecting bootstrap/loading timeouts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, wrapping DFINITY's AuthClient to expose login, logout, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor calls, covering user profiles, integration settings, sales config, leads, orders, projects, and more.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark themes including sidebar, chart, and utility gradient classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace/servicesCatalog.ts": "Exports a static array of 30 catalog services with name and description fields for use in the marketplace UI.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying summary stats (revenue, leads, projects, orders) fetched via React Query hooks, with navigation cards and a logout button.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics page showing KPI cards and Recharts bar, line, and pie charts for revenue trends and lead status distribution using live and mock data.",
  "frontend/src/pages/AutomationPage.tsx": "Automation settings page allowing users to toggle integration automations (WhatsApp, proposals, payments, onboarding) and configure AI sales system features via a dialog.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that lists cart items with quantity controls and removal, and shows an order summary with subtotal, 18% GST, and a total, navigating to checkout on confirmation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that lets users select between Stripe and Razorpay payment methods (based on configuration and service eligibility), then initiates the appropriate payment session or shows a placeholder for Razorpay.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Client portal dashboard showing the logged-in user's role badge and navigation cards linking to Projects, Services, Payments, and Profile sections, with a logout button.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Placeholder page for client project onboarding that displays a card with a message indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/CRMPage.tsx": "Displays a Kanban-style CRM pipeline board with six stages (New Lead through Lost), fetching activities via a query hook and rendering color-coded stage columns with activity cards showing type icons, notes, and creator info.",
  "frontend/src/pages/DashboardPage.tsx": "Admin/member dashboard displaying KPI cards for revenue, active leads, active projects, and paid orders, along with quick-action buttons for common navigation tasks.",
  "frontend/src/pages/DataExportCenterPage.tsx": "Admin-only data export center that allows exporting various data modules (leads, invoices, payments, WhatsApp logs, services, projects, CRM activities) in CSV or JSON format by calling backend actor methods.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays a grid of six AI-powered sales tool cards (recommendation, proposal, pricing, closing scripts, follow-up, qualification) with navigation to their respective routes.",
  "frontend/src/pages/InvoiceHistoryPage.tsx": "Shows a searchable list of invoices fetched from the backend and provides download options for individual invoices (text) and bulk exports (CSV, JSON).",
  "frontend/src/pages/LandingPage.tsx": "Empty landing page file with no content.",
  "frontend/src/pages/LeadsPage.tsx": "Full-featured leads management page with create/delete dialogs, filtering, table/grid views, export toolbar, detail panel, payment link dialog, and admin vs. user query switching.",
  "frontend/src/pages/LegalPage.tsx": "Renders a grid of required legal document cards (Privacy Policy, Terms, etc.) fetched from the backend, showing content or a placeholder if not yet created.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login flow, checks for an existing user profile, and shows a profile-setup dialog for new users before redirecting to the authenticated area.",
  "frontend/src/pages/ManagerDashboardPage.tsx": "Manager-specific dashboard showing lead stats (total, active, closed) and quick-navigation cards to leads and CRM pages, with a logout button.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications in tabbed unread/read views, supports marking notifications as read, and navigates to relevant pages based on notification type.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple error page shown after a failed payment, with buttons to return to the cart or dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Admin payments page showing revenue stats, orders, and payment links in a tabbed layout with status indicators.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Success page shown after a completed payment that clears the cart and provides navigation to projects or dashboard.",
  "frontend/src/pages/PricingStrategyPage.tsx": "Interactive pricing calculator that applies urgency, complexity, and add-on multipliers to a base price, generates psychological pricing suggestions, and supports exporting results.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Detail view for a single project fetched by ID from route params, displaying status, service ID, and start date.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects for the authenticated client in a responsive card grid, resolving service names and showing status badges.",
  "frontend/src/pages/ProposalGeneratorPage.tsx": "A page that lets users fill in client and project details to generate a downloadable business proposal, with support for deliverables, add-ons, and export as HTML or JSON.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays detailed information for a single service including features and three pricing tiers (Basic, Pro, Premium), with add-to-cart functionality for each tier.",
  "frontend/src/pages/ServiceRecommendationPage.tsx": "A page where users input business type, budget, and goals to receive AI-simulated service recommendations, upsell suggestions, and revenue strategies, with export options.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all agency services in a searchable grid with admin controls for creating, editing, deleting, and managing payment options per service.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that renders the Razorpay configuration panel and a placeholder for Stripe configuration.",
  "frontend/src/pages/WhatsAppLogsPage.tsx": "Displays a filterable, searchable list of WhatsApp message logs fetched from the backend, with export options for CSV, JSON, and a monthly report.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "A React Query mutation hook that calls the backend actor to create a Stripe checkout session and returns the session ID and redirect URL.",
  "frontend/src/utils/exportUtils.ts": "Provides utility functions to format and export Lead and Invoice data to CSV and PDF formats, including qualification tier computation, currency/date formatting, and browser download triggering.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence and helpers to clear sensitive params from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, typography, border radii, shadows, and background gradients for the frontend design system.",
  "project_state.json": "Tracks the overall project state for an AI agency platform CRM, documenting architectural notes, known issues, and a list of pending fix requests (AR-1 through AR-9+) covering API settings persistence, webhook triggers, automation toggles, AI response display, and exports."
}