{
  "backend/main.mo": "Main Motoko actor for the Quick Bee backend, defining all core data types (User, Service, Project, Lead, Order, CRM, etc.) and including mixins for authorization, blob storage, and Stripe/HTTP outcall integrations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (automation workflows, lead submission workflow, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON dictionary providing one-line summaries of every frontend source file, used as a build/documentation reference for the project's frontend structure.",
  "frontend/index.css": "Root Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, sidebar, chart, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the Quick Bee Agency frontend, mounting the React app at #root and setting the page title and favicon.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with all application routes (dashboard, leads, CRM, services, workflows, analytics, etc.) wrapped in QueryClient, ThemeProvider, and AIConfigProvider.",
  "frontend/src/auth/demoCredentials.ts": "Empty file intended to export demo credential objects for Admin and Manager roles.",
  "frontend/src/auth/useSession.ts": "Empty file intended to provide a session management hook using sessionStorage.",
  "frontend/src/cart/useCart.ts": "React hook managing a shopping cart with localStorage persistence, supporting add, remove, update quantity, and clear operations with total and item count calculations.",
  "frontend/src/components/analytics/AnalyticsMetricsCard.tsx": "Displays a responsive grid of five analytics KPI cards (Total Users, Sessions, Bounce Rate, Top Traffic Source, Conversion Rate) with icons and descriptions.",
  "frontend/src/components/analytics/GrowthSummaryPanel.tsx": "Displays a Growth Summary card with four sections (trends, drop-off insights, funnel suggestions, SEO tips), using provided data or default placeholder text when no analytics endpoint is connected.",
  "frontend/src/components/automation/SalesSystemConfigDialog.tsx": "A dialog for configuring a sales system integration by entering and saving an API endpoint and API key, with a test-connection feature and persistence via a backend mutation hook.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Renders a full-screen error card for bootstrap failures, showing timeout or connection-error messaging with troubleshooting tips and retry/reload buttons.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "Guards protected routes by showing a loading spinner or BootstrapErrorPanel while the actor and identity initialize, passing through immediately on login pages or for unauthenticated users.",
  "frontend/src/components/content/ContentSectionCard.tsx": "A card component that displays a titled content section with a scrollable monospace text area and a copy-to-clipboard button.",
  "frontend/src/components/generators/AICredentialBanner.tsx": "Shows a dismissible amber alert banner when AI credentials are not configured, with an optional button to open the settings dialog.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout shell composed of a sidebar navigation, top navigation bar, and a scrollable main content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "Renders a collapsible sidebar navigation with grouped nav items (Sales & CRM, AI Smart Systems, Automations, Commerce, etc.), role-based visibility, and logout functionality.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar component displaying a search input, notification bell with unread count popover, settings link, and user profile with role badge.",
  "frontend/src/components/leads/AutomationLogsPanel.tsx": "A slide-out sheet panel that displays filterable automation event logs for a specific lead or all leads, with CSV export functionality.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Toolbar component shown when leads are selected, providing bulk actions for status change, export, delete, and clearing the selection.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "Dialog that allows updating the status of multiple selected leads at once, iterating through each and reporting success/failure counts.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "Dialog for editing a payment link's URL and QR code, supporting QR generation via an external API or manual image upload.",
  "frontend/src/components/leads/IntegrationConfigDialog.tsx": "Dialog for configuring third-party integrations (WhatsApp, Airtable, Google Sheets, Resend, Razorpay) by collecting and saving their API credentials.",
  "frontend/src/components/leads/IntegrationPanel.tsx": "A slide-out Sheet panel that lists third-party integrations (WhatsApp, Razorpay, Airtable, etc.) with toggle switches to enable/disable each automation and a config dialog for per-integration settings, persisted via ICP query hooks.",
  "frontend/src/components/leads/LeadDetailPanel.tsx": "A slide-out Sheet panel displaying full details of a selected lead (contact info, status, qualification score) along with a GST quote calculator that computes tax and total before saving via the updateLead mutation.",
  "frontend/src/components/leads/LeadExportToolbar.tsx": "A toolbar component providing buttons to export all leads or only selected leads to CSV, and to download a PDF report, using utility functions from exportUtils.",
  "frontend/src/components/leads/LeadFilterPanel.tsx": "A filter panel with search input, status/channel dropdowns, and a score-range slider that emits updated filter state via a callback, with a clear-all option when any filter is active.",
  "frontend/src/components/leads/LeadTableView.tsx": "A sortable, selectable data table for leads that supports column sorting, row checkboxes, inline status updates via a dropdown, and row click to open a detail panel.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "A dialog that displays a generated payment link with its amount, a copyable URL, an optional QR code with download support, and an edit action that opens an EditPaymentLinkDialog.",
  "frontend/src/components/leads/QualificationBadge.tsx": "A small badge component that maps a numeric lead score to a qualification tier (Cold/Warm/Hot/Qualified) and renders it with a corresponding icon and color style.",
  "frontend/src/components/services/BuyNowButton.tsx": "A reusable button component that triggers a purchase callback with item name, price, and tier label, showing a loading spinner while processing.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "A dialog component for creating a new service with fields for name, description, category, pricing tiers (basic/pro/premium), features, and settings like visibility and availability.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "A confirmation dialog for deleting a service, showing the service name and calling the delete mutation on confirmation.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "A dialog for editing an existing service's details including name, description, pricing tiers, features, and settings, pre-populated with the service's current data.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "A dialog for managing a service's payment information, allowing users to set a custom payment URL and generate or upload a QR code image.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "A read-only card component that displays a service's payment link (with copy button) and QR code (with download button) if they exist.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "A dialog for configuring Razorpay payment settings for a service, including enabling/disabling Razorpay and setting the Key ID and Order ID.",
  "frontend/src/components/services/TierSelector.tsx": "A button-group component for selecting a pricing tier, displaying each tier's name and formatted INR price with active/inactive styling.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A settings panel component for configuring Razorpay API credentials (key, secret, webhook secret) with show/hide toggle and save functionality, displaying current configuration status.",
  "frontend/src/components/workflows/WorkflowCard.tsx": "A card component that displays a workflow's name, description, trigger, and active status, with a run button that executes the workflow and shows the result or last execution status.",
  "frontend/src/components/workflows/WorkflowResultDisplay.tsx": "A display component that renders the result of a workflow execution, showing status (success/error/pending), action ID, message, data-logged flag, and next steps.",
  "frontend/src/contexts/AIConfigContext.tsx": "A React context provider that manages and persists webhook/integration configuration (URLs, API keys, automation toggles, Calendly settings) in localStorage, with helpers for testing connections and checking field status.",
  "frontend/src/contexts/WebhookLogContext.tsx": "A React context provider that maintains an in-session log of webhook call entries (up to 500) stored in sessionStorage, with methods to add, clear, and filter log entries.",
  "frontend/src/data/agencyPlans.ts": "Defines and exports three agency pricing plans (Spark, Surge, Titan) with their price ranges, target audiences, descriptions, and feature lists.",
  "frontend/src/data/individualPackages.ts": "Defines and exports an array of individual service packages (e.g., website development, SEO, WhatsApp automation) each with pricing, category, description, and feature list.",
  "frontend/src/data/maintenancePlans.ts": "Defines typed data structures and static data for maintenance plan categories (website, app, AI automation, marketing) with tiered pricing in INR, plus a helper to format price ranges.",
  "frontend/src/data/masterServiceCatalog.ts": "Defines typed interfaces and static catalog data for all services (web dev, app dev, AI automation, etc.) organized by category, each with pricing tiers and feature lists.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and an optional admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAIContentGeneration.ts": "Custom hook that calls a configured AI API endpoint to generate SEO blog content, social media captions, LinkedIn posts, and Instagram carousel outlines for a given keyword, then parses the response into structured sections.",
  "frontend/src/hooks/useAutomationTriggers.ts": "Custom hook that provides functions to POST automation events (WhatsApp reply, proposal send, lead follow-up, payment confirmation, project onboarding) to a configured webhook URL, logging each attempt via WebhookLogContext.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Custom hook that sets a timed-out flag after a configurable timeout (default 5 seconds), useful for detecting stalled bootstrap/loading states.",
  "frontend/src/hooks/useDirectPurchase.ts": "Custom hook that adds a service item directly to the cart and navigates to the checkout page, with loading state and toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useLeadFollowUpTrigger.ts": "Thin wrapper hook around useAutomationTriggers that exposes a single function to trigger a lead follow-up automation event by lead ID and data.",
  "frontend/src/hooks/useMeetingSchedulingWorkflow.ts": "Hook that generates a Calendly booking link (optionally pre-filled with lead info), copies it to the clipboard, and posts the event to the automation webhook.",
  "frontend/src/hooks/useNewLeadSubmissionWorkflow.ts": "Hook that validates lead form data and submits it to both CRM and automation webhooks, returning a structured WorkflowResult with status and next steps.",
  "frontend/src/hooks/usePaymentProcessingWorkflow.ts": "Hook exposing two callbacks—triggerPaymentSuccess and triggerPaymentFailure—that post payment events to the automation webhook and return a WorkflowResult with an invoice reference.",
  "frontend/src/hooks/useQueries.ts": "Centralised collection of React Query hooks (useQuery/useMutation) for all backend actor calls, covering user profiles, roles, leads, CRM, services, orders, payments, and configuration entities.",
  "frontend/src/hooks/useWebhookPost.ts": "React Query mutation hook that POSTs a named tool payload to the configured webhook URL, logs the request/response via WebhookLogContext, and handles auth headers.",
  "frontend/src/hooks/useWorkflowExecution.ts": "Provides shared utilities for workflow execution: types, localStorage-backed webhook and execution logging helpers, a generic postToWebhook fetch wrapper, and a useWorkflowExecution hook that tracks running state and results.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, sets up Tailwind CSS, and defines CSS custom properties for light/dark themes including colors, sidebar, and chart variables.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/marketplace/servicesCatalog.ts": "Exports a static catalog of 30 marketing and business services, each with a name and short description, used for the marketplace feature.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying key stats (revenue, leads, projects, orders) as gradient cards and navigation buttons to manage leads, orders, and projects, with logout functionality.",
  "frontend/src/pages/AnalyticsEnginePage.tsx": "AI-powered analytics engine page that accepts a date range input and either fetches live data via a configured webhook or returns simulated GA4 metrics and growth summaries.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics dashboard page showing KPI cards and Recharts visualizations (bar, line, pie) for revenue trends and lead status distribution derived from fetched leads, orders, and services data.",
  "frontend/src/pages/AutomationPage.tsx": "Automation settings page that renders toggleable automation cards (WhatsApp auto-reply, proposal send, lead follow-up, etc.) and indicates whether the automation webhook URL is configured.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that lists cart items with quantity controls and removal, and shows an order summary with subtotal, 18% GST, and a checkout navigation button.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that lets users choose between Stripe and Razorpay payment methods, builds a checkout session from cart items, and redirects to the payment provider URL.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Client portal dashboard showing the user's role and name with navigation cards linking to Projects, Services, Payments, and Profile, plus a logout button.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Placeholder onboarding page for clients that displays a static card indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/ClosingScriptsPage.tsx": "AI-powered sales closing script generator that accepts prospect details and objection type, then calls an API or webhook to produce three tailored closing scripts with copy and export functionality.",
  "frontend/src/pages/ContentCreatorPage.tsx": "AI content creation page that generates blog content, social captions, LinkedIn posts, and Instagram carousels from a keyword, with webhook logging and text export support.",
  "frontend/src/pages/CRMPage.tsx": "Displays a Kanban-style CRM board with six pipeline stages, fetching activities via a query hook and rendering each as a card with activity-type icons and stage-colored columns.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying KPI cards (revenue, leads, projects, paid orders) and quick action buttons, fetching data via React Query hooks and showing a personalized welcome header.",
  "frontend/src/pages/DataExportCenterPage.tsx": "Admin-only page that allows exporting various data modules (leads, invoices, payments, etc.) in CSV or JSON format by calling backend actor methods and triggering file downloads.",
  "frontend/src/pages/FollowUpMessagesPage.tsx": "AI-powered tool page that generates a 5-message follow-up sequence for a sales lead by sending a prompt to a configured API endpoint and optionally posting form data to a webhook.",
  "frontend/src/pages/GeneratorsPage.tsx": "Index/hub page listing six AI sales tools (proposal generator, pricing strategy, closing scripts, etc.) as clickable cards that navigate to their respective sub-routes.",
  "frontend/src/pages/InvoiceHistoryPage.tsx": "Page that fetches and displays all invoices with search filtering, and supports downloading individual invoices as text files or exporting all invoices as CSV or JSON.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component (content truncated); serves as the public-facing entry point of the frontend application.",
  "frontend/src/pages/LeadQualificationPage.tsx": "A page that collects lead details (company size, budget, urgency, decision-maker status, needs description) and uses an AI API or webhook to generate a BANT-based qualification score, tier (Hot/Warm/Cold), strengths, risks, and next steps. Results can be exported to JSON.",
  "frontend/src/pages/LeadsPage.tsx": "The main leads management page that displays all or personal leads in table/grid views with filtering, sorting, export, and detail panels. Includes a dialog for creating new leads and integrates payment link creation.",
  "frontend/src/pages/LegalPage.tsx": "Displays a read-only grid of required legal documents (Privacy Policy, Terms & Conditions, etc.) fetched from the backend, showing content previews or a placeholder if not yet created.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity authentication, redirecting existing users to their role-based dashboard or showing a first-time profile setup dialog for new users. Manages login state, errors, and profile saving.",
  "frontend/src/pages/ManagerDashboardPage.tsx": "A dashboard for manager-role users showing personal lead stats (total, active, closed) and quick-navigation cards to the Leads and CRM pages, with a logout button.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays the current user's notifications split into unread and read tabs, with click-to-navigate behavior based on notification type and a button to mark individual notifications as read.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure screen with error messaging and retry/dashboard navigation buttons, and triggers a payment failure workflow on mount using URL/session params.",
  "frontend/src/pages/PaymentsPage.tsx": "Renders a payments dashboard with revenue stats and tabbed views for orders and payment links, fetching data via React Query hooks and supporting status updates.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation screen with an invoice reference and navigation to projects/dashboard, triggering a payment success workflow on mount using URL/session params.",
  "frontend/src/pages/PricingStrategyPage.tsx": "Provides a pricing strategy calculator with inputs for service type, base cost, urgency, complexity, and add-ons, optionally sending results to a webhook or AI API for suggestions and CSV export.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays detailed information for a single project (ID, status, service ID, start date) fetched by project ID from the route params.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects for the authenticated user in a responsive card grid, showing project status, associated service name, and start date with loading skeletons.",
  "frontend/src/pages/ProposalGeneratorPage.tsx": "A page that collects client and project details via a form, then generates a structured business proposal by calling an AI API and/or posting to a webhook, with export-to-text functionality.",
  "frontend/src/pages/SalesSystemConfigPage.tsx": "A settings page for configuring and testing various integration credentials (webhooks, API keys, WhatsApp, Razorpay, email, Calendly) with toggle switches, secret masking, and connection status badges.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays detailed information for a single service fetched by ID, showing Basic/Pro/Premium pricing tiers and allowing users to add a selected tier to the cart.",
  "frontend/src/pages/ServiceRecommendationPage.tsx": "An AI-powered page where users select business types, goals, budget, and team size to receive a tailored service recommendation with projected ROI, sent via webhook and/or AI API.",
  "frontend/src/pages/ServicesPage.tsx": "A comprehensive services catalog page with static data for tiered services, individual packages, maintenance plans, and agency plans, featuring search, category tabs, and add-to-cart functionality.",
  "frontend/src/pages/SettingsPage.tsx": "An admin-only settings page that renders the Razorpay configuration panel and a placeholder for Stripe configuration, with an access-denied state for non-admins.",
  "frontend/src/pages/WebhookLogsPage.tsx": "Displays a filterable, searchable table of outgoing webhook log entries with status badges, and allows clearing all logs via a confirmation dialog.",
  "frontend/src/pages/WhatsAppLogsPage.tsx": "Fetches and displays WhatsApp message delivery logs from the backend with search/filter support and export options for CSV, JSON, and a monthly report.",
  "frontend/src/pages/WorkflowsPage.tsx": "Renders a workflows dashboard with test-run forms for lead submission, meeting scheduling, and payment processing workflows, restricted to non-guest roles.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "Provides a React Query mutation hook that calls the backend actor to create a Stripe checkout session and returns the session ID and redirect URL.",
  "frontend/src/utils/exportContent.ts": "Exports AI-generated content (blog, social captions, LinkedIn, Instagram) as a formatted plain-text file download.",
  "frontend/src/utils/exportUtils.ts": "Provides utility functions to export leads, invoices, and WhatsApp logs as CSV or PDF (HTML print), including a qualification tier helper.",
  "frontend/src/utils/formatCurrency.ts": "Exports helpers to format numbers as Indian Rupee currency strings, including a price range formatter.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters from both standard and hash-based routing, with sessionStorage persistence and hash cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens (background, primary, sidebar, chart, etc.), custom font families (Inter, Poppins), border radii, box shadows, and background gradients.",
  "project_state.json": "Project state manifest (version 19) for the Quick Bee AI Growth Engine platform, documenting the architecture, existing features, known issues, and multi-step build plan covering Lead Management CRM, Automation Dashboard, webhook-based integrations, and AI Smart Systems."
}