{
  "backend/main.mo": "Main Motoko actor for the QuickBee Agency backend, defining all data types (User, Service, Project, Lead, Order, CRM, etc.) and including mixins for authorization, storage, and Stripe/HTTP integrations.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to their implementation files, components, test IDs, and confidence levels for managed-service hooks and the ServiceManagementPage.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, used as a reference index for build planning and code navigation.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point for the Quick Bee Agency frontend, mounting the React app at #root and loading the main TSX module.",
  "frontend/src/App.tsx": "TanStack Router app setup registering all page routes under an authenticated shell, with root and login routes redirecting directly to /authenticated/dashboard and BootstrapGate wrapping the outlet.",
  "frontend/src/auth/demoCredentials.ts": "Empty file intended to export demo credential objects and a DemoRole type for admin and manager roles.",
  "frontend/src/auth/useSession.ts": "Empty file intended to provide a session management hook for storing and retrieving session data in sessionStorage.",
  "frontend/src/cart/useCart.ts": "React hook managing a shopping cart with localStorage persistence, supporting add, remove, update quantity, and clear operations with total and item count derived values.",
  "frontend/src/components/analytics/AnalyticsMetricsCard.tsx": "Displays a responsive grid of five analytics KPI cards (total users, sessions, bounce rate, top traffic source, conversion rate) with icons and descriptions.",
  "frontend/src/components/analytics/GrowthSummaryPanel.tsx": "Displays a Growth Summary card with four sections (trends, drop-off insights, funnel suggestions, SEO tips) using provided data or default placeholder text when no analytics endpoint is connected.",
  "frontend/src/components/automation/SalesSystemConfigDialog.tsx": "A dialog for configuring a sales system integration by entering and saving an API endpoint and API key, with a connection test feature and persistence via backend hooks.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Renders a full-screen error card for bootstrap failures, showing timeout or connection error messaging with retry and reload actions.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "A passthrough gate component that renders its children immediately without any auth or actor checks.",
  "frontend/src/components/content/ContentSectionCard.tsx": "Displays a titled content section card with a scrollable monospace text area and a clipboard copy button with toast feedback.",
  "frontend/src/components/generators/AICredentialBanner.tsx": "Shows a dismissible warning banner when AI credentials are not configured, with an optional button to open the settings dialog.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout shell combining a sidebar navigation, top navigation bar, and a scrollable main content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "Renders a collapsible grouped sidebar navigation with links to all major app sections, highlighting the active route.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with a search input, a notification popover showing unread count, and a settings button.",
  "frontend/src/components/leads/AutomationLogsPanel.tsx": "A slide-out Sheet panel that displays filterable automation event logs for a lead or all leads, with search functionality and CSV export support.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "A toolbar component shown when leads are selected in bulk, providing buttons for changing status, exporting, deleting, and clearing the selection.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "A dialog that allows bulk updating the status of multiple selected leads via a dropdown, using the bulk update mutation hook.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "A dialog for editing a payment link's URL and QR code data URL, saving changes via separate mutation hooks for each field.",
  "frontend/src/components/leads/IntegrationConfigDialog.tsx": "A dialog that renders integration-specific credential input fields (e.g., WhatsApp, Airtable, Razorpay) and calls an onSave callback with the entered config values.",
  "frontend/src/components/leads/IntegrationPanel.tsx": "A slide-out Sheet panel listing available integrations with toggle switches to enable/disable each and a settings button to open the IntegrationConfigDialog for credential configuration.",
  "frontend/src/components/leads/LeadDetailPanel.tsx": "A side panel displaying detailed information for a selected lead, including contact info, qualification score bar, business details, and edit/delete action buttons.",
  "frontend/src/components/leads/LeadExportToolbar.tsx": "A toolbar component that provides buttons to export all leads or selected leads as CSV, and generate a PDF report using utility functions.",
  "frontend/src/components/leads/LeadFilterPanel.tsx": "A filter panel component for leads that supports search, status, channel, and score range filters with a clear-all option.",
  "frontend/src/components/leads/LeadTableView.tsx": "A sortable, selectable table component for displaying leads with status/score color coding and per-row view, edit, and delete actions.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "A dialog that displays payment link details (amount, status, URL, QR code) with options to copy the URL, download the QR code, or open an edit dialog.",
  "frontend/src/components/leads/QualificationBadge.tsx": "A badge component that displays a lead's qualification tier (Qualified, Hot, Warm, Cold) with corresponding icons and styles based on a numeric score.",
  "frontend/src/components/services/BuyNowButton.tsx": "A reusable button component that triggers a purchase action for a service item, supporting loading and disabled states.",
  "frontend/src/components/services/ManagedServiceFormDialog.tsx": "A multi-tab dialog form for creating or editing a managed service, including fields for packages, add-ons, features, pricing type, and category.",
  "frontend/src/components/services/ManagedServicePreviewModal.tsx": "A preview modal for a managed service that lets users select packages, toggle add-ons, adjust quantity, and view a calculated total price.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "A dialog component for creating a new service with fields for name, description, category, pricing tiers (basic/pro/premium), features, and settings like visibility and availability.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "A confirmation dialog that prompts the user to confirm deletion of a service, calling the delete mutation on confirmation.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "A dialog for editing an existing service's details including name, description, pricing tiers, features, and settings, pre-populated with the service's current values.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "A dialog for managing a service's payment information, allowing users to set a custom payment URL, generate or upload a QR code, and save the changes.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "A read-only card component that displays a service's payment link and QR code with copy and download actions; renders nothing if no payment info exists.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "A dialog for configuring Razorpay payment settings for a service, including enabling/disabling Razorpay and setting the Key ID and Order ID.",
  "frontend/src/components/services/TierSelector.tsx": "A button-group component that renders selectable pricing tier options, highlighting the currently selected tier and displaying its formatted INR price.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A React settings panel for entering and saving Razorpay API key, secret, and webhook secret, storing the configuration in localStorage with show/hide toggles for sensitive fields.",
  "frontend/src/components/workflows/WorkflowCard.tsx": "A card component that displays a workflow's name, description, trigger, active status, and last execution result, with a Run button that shows a loading state while the workflow executes.",
  "frontend/src/components/workflows/WorkflowResultDisplay.tsx": "Displays the result of a workflow execution including status badge, action ID, message, data-logged indicator, and a list of next steps, styled by success/error/pending state.",
  "frontend/src/contexts/AIConfigContext.tsx": "Provides a React context for managing and persisting AI/integration configuration (API keys, webhooks, automation toggles) in localStorage, with helpers for testing connections and checking field configuration status.",
  "frontend/src/contexts/WebhookLogContext.tsx": "Provides a React context for storing, adding, and clearing webhook log entries in sessionStorage, capped at 500 entries.",
  "frontend/src/data/agencyPlans.ts": "Defines and exports three agency pricing plans (Spark, Surge, Titan) with metadata including price ranges, target audiences, descriptions, and feature lists.",
  "frontend/src/data/individualPackages.ts": "Defines and exports an array of individual service packages (e.g., website development, SEO, WhatsApp automation) each with pricing, category, description, and a detailed feature list.",
  "frontend/src/data/maintenancePlans.ts": "Defines TypeScript interfaces and data for maintenance plan categories (website, app, AI automation, marketing) with tiered pricing in INR, plus a helper to format price ranges.",
  "frontend/src/data/masterServiceCatalog.ts": "Defines interfaces and a comprehensive catalog of services (web dev, app dev, AI, marketing, branding, SaaS, business setup) with multi-tier INR pricing and feature lists.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAIContentGeneration.ts": "Custom hook that sends a prompt to a configured AI API endpoint (OpenAI-compatible), logs the request/response, optionally posts to an automation webhook, and returns the generated content with workflow result metadata.",
  "frontend/src/hooks/useAutomationTriggers.ts": "Custom hook providing functions to trigger automation webhooks for WhatsApp auto-reply, proposal auto-send, and lead follow-up, each guarded by feature-flag checks from AI config.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Custom hook that sets a timeout flag after a configurable delay (default 5s) to detect bootstrap/initialization timeouts, with a reset callback.",
  "frontend/src/hooks/useDirectPurchase.ts": "Custom hook that adds a service item directly to the cart and navigates to the checkout page, with loading state and toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useLeadFollowUpTrigger.ts": "Thin wrapper hook around useAutomationTriggers that exposes a single function to trigger a lead follow-up automation with a lead ID and associated data.",
  "frontend/src/hooks/useMeetingSchedulingWorkflow.ts": "Hook that generates a Calendly meeting link, copies it to clipboard, optionally posts a webhook event, and saves the workflow execution result to localStorage.",
  "frontend/src/hooks/useNewLeadSubmissionWorkflow.ts": "Hook that submits new lead data to configured CRM and/or automation webhooks and saves the workflow execution result.",
  "frontend/src/hooks/usePaymentProcessingWorkflow.ts": "Hook providing two callbacks—triggerPaymentSuccess and triggerPaymentFailure—that post payment events to a configured automation webhook and return structured workflow results with invoice references.",
  "frontend/src/hooks/useQueries.ts": "Central React Query hooks file defining local TypeScript interfaces (Lead, Project, Order, etc.) and query/mutation hooks for interacting with the backend actor, including user profile, services, and other entities.",
  "frontend/src/hooks/useWebhookPost.ts": "React Query mutation hook that POSTs a tool name and form data payload to the configured automation or fallback webhook URL, logging the request and response via WebhookLogContext.",
  "frontend/src/hooks/useWorkflowExecution.ts": "Utility module exporting shared workflow helpers (generateActionId, postToWebhook, saveWorkflowExecution, getLastWorkflowExecution) and a useWorkflowExecution hook that manages running state and result for arbitrary async workflow functions.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, sets up Tailwind base/components/utilities, and defines CSS custom properties for a dark-themed design system including gold accent colors and sidebar variables.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider, InternetIdentityProvider, and the root App component.",
  "frontend/src/marketplace/servicesCatalog.ts": "Static catalog of 30 marketing and digital services, each with a name and short description, exported as a typed array.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying platform-wide stats (revenue, leads, projects, orders) as stat cards, with navigation shortcuts to Leads and Analytics pages.",
  "frontend/src/pages/AnalyticsEnginePage.tsx": "Analytics engine page that lets users run analytics workflows over a date range, posting to a configured webhook or falling back to simulated GA4 metrics and growth summaries.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics dashboard page showing KPI cards and Recharts-based bar, line, and pie charts for revenue trends and lead status distribution using real and mock data.",
  "frontend/src/pages/AutomationPage.tsx": "Automation center page listing configurable workflow toggles (WhatsApp auto-reply, proposal send, lead follow-up, payment confirmation, onboarding) with enable/disable switches backed by AIConfigContext.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls and removal, plus an order summary card with GST calculation and a checkout navigation button.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders a checkout page that displays an order summary from the cart and initiates a Stripe payment session, redirecting the user to Stripe's hosted checkout URL.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Displays a client portal dashboard with navigation cards linking to Projects, Services, Payments, and Profile, along with user role badge and logout functionality.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "A placeholder page for client onboarding that renders a card with a message indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/ClosingScriptsPage.tsx": "Provides a form to generate AI-powered sales closing scripts tailored to a prospect's name, industry, and objection, with options to copy, export, and optionally post to a webhook.",
  "frontend/src/pages/ContentCreatorPage.tsx": "Allows admin/non-guest users to generate SEO-optimized content (blog post, social captions, LinkedIn post, Instagram carousel) from a keyword using an AI API, with export support.",
  "frontend/src/pages/CRMPage.tsx": "CRM pipeline page rendering a Kanban-style board of CRM activities grouped by sales stage, with search filtering and skeleton loading states.",
  "frontend/src/pages/DashboardPage.tsx": "Admin dashboard showing KPI cards (revenue, leads, projects, paid orders) derived from backend queries, plus quick-action buttons for common navigation tasks.",
  "frontend/src/pages/DataExportCenterPage.tsx": "Provides per-module and full-platform data export functionality (JSON/CSV) for services, managed services, and recommendations by calling backend actor methods.",
  "frontend/src/pages/FollowUpMessagesPage.tsx": "A page that generates a 5-message follow-up sequence for sales leads using AI, with inputs for lead name, pipeline stage, last interaction, and follow-up goal. Supports webhook posting and AI API calls, with copy/export functionality.",
  "frontend/src/pages/GeneratorsPage.tsx": "A hub page displaying a grid of six AI-powered sales tools (service recommender, proposal generator, pricing strategy, closing scripts, follow-up messages, lead qualification) as clickable cards that navigate to their respective routes.",
  "frontend/src/pages/InvoiceHistoryPage.tsx": "Displays a searchable list of invoices fetched from the backend, with options to export as CSV or JSON and download individual invoices as text files.",
  "frontend/src/pages/LandingPage.tsx": "An empty landing page file with no content.",
  "frontend/src/pages/LeadQualificationPage.tsx": "A page that scores and qualifies sales leads using the BANT framework via AI, taking inputs like company size, budget, urgency, and needs description, then displaying a structured qualification result with score, tier, strengths, and risks.",
  "frontend/src/pages/LeadsPage.tsx": "A full-featured leads management page supporting list/grid views, filtering, creating/deleting leads, payment link generation, and automation logs, with a dialog form for adding new leads with BANT-style fields.",
  "frontend/src/pages/LegalPage.tsx": "Displays a grid of six required legal document cards (Privacy Policy, Terms & Conditions, etc.) fetched from the backend, showing content previews or a placeholder if not yet created.",
  "frontend/src/pages/LoginPage.tsx": "A minimal login page that immediately redirects users to the authenticated dashboard on mount, rendering nothing.",
  "frontend/src/pages/ManagerDashboardPage.tsx": "Displays a manager's dashboard with lead statistics (total, active, closed) fetched via React Query hooks, and provides navigation cards to leads and CRM sections along with a logout button.",
  "frontend/src/pages/NotificationsPage.tsx": "Renders a notifications page with tabbed filtering (all/unread/read) and allows users to mark individual notifications as read using a mutation hook.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure screen, triggers a payment failure workflow on mount using URL/session params, and displays the workflow result alongside retry and dashboard navigation buttons.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays a tabbed payments page listing orders and payment links with status badges, copy/open actions for payment link URLs, and summary stats for totals and paid amounts.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment success screen, triggers a payment success workflow on mount to retrieve an invoice reference, and provides navigation to projects or the dashboard.",
  "frontend/src/pages/PricingStrategyPage.tsx": "Provides a pricing strategy tool where users input service details, urgency, complexity, and add-ons to calculate a recommended price, optionally sending data to a webhook or AI endpoint for suggestions with CSV export support.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays detailed information for a single project (ID, status, service ID, start time) fetched by project ID from the route params.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects belonging to the authenticated user in a responsive card grid, showing status badges, service names, and start dates with loading skeletons.",
  "frontend/src/pages/ProposalGeneratorPage.tsx": "AI-powered proposal generator form that posts to a webhook and/or an OpenAI-compatible API to produce a structured business proposal, with export-to-text functionality.",
  "frontend/src/pages/SalesSystemConfigPage.tsx": "Configuration page for managing integration credentials (AI API, WhatsApp, Razorpay, email, webhooks, Calendly) with toggle switches, secret visibility toggles, and connection testing.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows full details of a single service including description, features, and three pricing tiers (Basic, Pro, Premium) with add-to-cart buttons for each tier.",
  "frontend/src/pages/ServiceManagementPage.tsx": "Admin page for managing services with a draggable card list supporting create, edit, delete, duplicate, preview, and visibility toggle operations via query hooks.",
  "frontend/src/pages/ServiceRecommendationPage.tsx": "A page that collects business type, budget, goals, and team size inputs, then calls a webhook and/or AI API to generate a service recommendation with ROI projection, and supports exporting the result as text.",
  "frontend/src/pages/ServicesPage.tsx": "A services catalog page displaying tiered (basic/pro/premium) services, individual packages, maintenance plans, and agency plans with INR pricing, search/filter, and cart integration.",
  "frontend/src/pages/SettingsPage.tsx": "A settings page that renders the Razorpay configuration panel and a placeholder card for future Stripe configuration.",
  "frontend/src/pages/WebhookLogsPage.tsx": "A page that displays filterable webhook/API call logs with success/error stats, search, status and event-type filters, and a confirmation dialog to clear all logs.",
  "frontend/src/pages/WhatsAppLogsPage.tsx": "A page that fetches and displays WhatsApp message delivery logs with status indicators, summary stats, search filtering, and CSV/JSON export functionality.",
  "frontend/src/pages/WorkflowsPage.tsx": "A page that lists and manually triggers predefined automation workflows (lead submission, meeting scheduling, payment processing, analytics, AI content), persisting execution results to localStorage and showing toast notifications.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "A React Query mutation hook that calls the backend actor to create a Stripe checkout session and returns the session ID and redirect URL.",
  "frontend/src/utils/exportContent.ts": "A utility function that formats AI-generated content (blog, social captions, LinkedIn, Instagram) into a structured text file and triggers a browser download.",
  "frontend/src/utils/exportUtils.ts": "Defines TypeScript interfaces for leads, invoices, WhatsApp logs, and automation logs, and provides utility functions to export these data types to CSV, PDF (as text), JSON, and generic object formats via browser download.",
  "frontend/src/utils/formatCurrency.ts": "Exports a function to format numbers as Indian Rupee (INR) currency strings and a helper to display a price range with monthly suffix.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive parameters from the URL without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Inter, Poppins), a full design-token color palette (gold, charcoal, semantic tokens), custom border radii, box shadows, background gradients, and keyframe animations.",
  "project_state.json": "Tracks the overall project state (version 31) for the Quick Bee AI Growth Engine platform, documenting the feature set, architectural decisions, known bugs, and a detailed list of existing and planned features across the CRM, automation dashboard, and AI tools."
}