{
  "backend/main.mo": "Main Motoko actor defining all backend data types (User, Service, Project, Lead, CRM, Order, etc.) and including mixins for authorization, blob storage, and Stripe/HTTP outcall integrations for a full-featured agency management platform.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their affected files, related components, test IDs, and confidence levels, covering login page rewrite, BootstrapGate fix, and Internet Identity hook integration.",
  "frontend-file-summaries.txt": "JSON document providing short descriptions of each frontend source file, serving as a reference index for the frontend codebase's structure and responsibilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, card, sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point for the Quick Bee Agency app, mounting the React root div and loading the main TypeScript module with a custom favicon.",
  "frontend/src/App.tsx": "Root React app file that configures TanStack Router with all public and authenticated routes, wraps the app in QueryClientProvider, ThemeProvider, AIConfigProvider, and WebhookLogProvider, and uses BootstrapGate with AppShell for protected layouts.",
  "frontend/src/auth/demoCredentials.ts": "Empty file intended to export demo credential objects and the DemoRole type for admin and manager test accounts.",
  "frontend/src/auth/useSession.ts": "Empty file intended to provide a session management hook for storing and retrieving authenticated user session data in sessionStorage.",
  "frontend/src/cart/useCart.ts": "React hook managing a shopping cart with localStorage persistence, supporting add, remove, update quantity, and clear operations along with computed total and item count.",
  "frontend/src/components/automation/SalesSystemConfigDialog.tsx": "A dialog component for configuring a sales system's API endpoint and key, with connection testing and save functionality backed by React Query hooks.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Displays a full-screen error card for bootstrap failures, showing timeout or connection error messages with retry and reload actions.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "A gate component that blocks protected routes with a loading spinner or error panel until the actor and identity are initialized, passing through unauthenticated or login-page requests immediately.",
  "frontend/src/components/generators/AICredentialBanner.tsx": "Renders a dismissible warning banner prompting the user to configure AI credentials when none are set, with an optional settings button.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout shell combining a sidebar, top navigation bar, and a scrollable main content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "Renders a collapsible grouped sidebar navigation with role-based visibility, active route highlighting, and a logout action.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with a search input, a notification popover showing unread counts, and user profile/role display.",
  "frontend/src/components/leads/AutomationLogsPanel.tsx": "A slide-out Sheet panel that displays automation event logs, supporting filtering by lead ID and search by event type/status, with CSV export functionality.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "A toolbar component shown when leads are selected, providing bulk actions for exporting, deleting, changing status, and clearing the selection.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "A dialog that allows users to update the status of multiple selected leads at once, iterating through each and reporting success/failure counts.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "A dialog for editing a payment link's custom URL and QR code, supporting QR generation via an external API or manual image upload.",
  "frontend/src/components/leads/IntegrationConfigDialog.tsx": "A dialog that renders integration-specific credential input fields (for WhatsApp, Airtable, Google Sheets, Resend, Razorpay) and saves the configuration via a callback.",
  "frontend/src/components/leads/IntegrationPanel.tsx": "A slide-out Sheet panel listing available integrations with toggle switches to enable/disable each, and a settings button to open the IntegrationConfigDialog for credential entry.",
  "frontend/src/components/leads/LeadDetailPanel.tsx": "A slide-out Sheet panel that displays detailed information for a selected lead, including contact info, qualification score, and a GST quote calculator with save functionality.",
  "frontend/src/components/leads/LeadExportToolbar.tsx": "A toolbar component providing buttons to export all leads or selected leads to CSV, and all leads to a PDF report.",
  "frontend/src/components/leads/LeadFilterPanel.tsx": "A filter panel component for leads that supports search, status, channel, and qualification score range filtering with a clear-all option.",
  "frontend/src/components/leads/LeadTableView.tsx": "A sortable, selectable table view for leads that supports inline status updates, row selection via checkboxes, and click-through to a lead detail panel.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "A dialog that displays a generated Razorpay payment link with copy, QR code download, and open-in-browser actions, and allows editing via a nested EditPaymentLinkDialog.",
  "frontend/src/components/leads/QualificationBadge.tsx": "A small badge component that displays a lead's qualification tier (Cold/Warm/Hot/Qualified) with an icon and optional numeric score, derived from a utility function.",
  "frontend/src/components/services/BuyNowButton.tsx": "A reusable button component that triggers a buy-now callback with item details and shows a loading spinner while processing.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "A multi-tab dialog form for creating a new service with name, description, category, three pricing tiers (Basic/Pro/Premium) with features, and visibility settings.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "A confirmation dialog component for deleting a service, showing the service name and using the `useDeleteService` mutation hook to perform the deletion.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "A multi-tab dialog for editing all service fields including name, description, pricing tiers, features, and settings, using the `useUpdateService` mutation hook to save changes.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "A dialog for editing a service's payment link URL and QR code, supporting QR generation via an external API or file upload, and saving via `useUpdateServicePaymentInfo`.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "A read-only card component that displays a service's payment link (with copy button) and QR code (with download button), rendering nothing if neither is available.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "A dialog for configuring per-service Razorpay settings including enabling the integration, Key ID, and Order ID, saved via the `useUpdateServiceRazorpay` mutation hook.",
  "frontend/src/components/services/TierSelector.tsx": "A small UI component that renders a row of clickable tier buttons (e.g., Basic, Pro, Premium) with their prices, highlighting the currently selected tier.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A settings card for entering and saving global Razorpay API credentials (key, secret, webhook secret), with a toggle to show/hide secrets and a configured/not-configured status indicator.",
  "frontend/src/contexts/AIConfigContext.tsx": "Provides a React context for managing webhook and API configuration (URLs, keys, tokens, automation toggles) with localStorage persistence, connection status tracking, and test connection functionality.",
  "frontend/src/contexts/WebhookLogContext.tsx": "Provides a React context for storing and querying webhook log entries (up to 500) with sessionStorage persistence, supporting filtering by event type and success/error status.",
  "frontend/src/data/agencyPlans.ts": "Defines and exports three tiered agency plans (Spark, Surge, Titan) with pricing, target audience, descriptions, and feature lists for the QuickBee agency offering.",
  "frontend/src/data/individualPackages.ts": "Defines and exports a catalog of individual service packages (website, funnel, WhatsApp automation, chatbot, etc.) each with a fixed INR price, category, and feature list.",
  "frontend/src/data/maintenancePlans.ts": "Defines and exports tiered maintenance plan categories (website, app, AI automation, marketing) with price ranges and features per tier, plus a price range formatting utility.",
  "frontend/src/data/masterServiceCatalog.ts": "Defines a comprehensive master service catalog with category metadata and detailed service entries (web, app, AI, marketing, etc.), each containing multi-tier INR pricing and feature lists.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an Internet Computer backend actor using the user's identity (or anonymous), initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAutomationTriggers.ts": "Custom hook that provides automation trigger functions (WhatsApp auto-reply, proposal send, lead follow-up, payment confirmation, project onboarding) by POSTing to a configured webhook URL and logging each attempt.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Custom hook that sets a timeout flag after a configurable delay, useful for detecting when app bootstrapping has taken too long.",
  "frontend/src/hooks/useDirectPurchase.ts": "Custom hook that adds an item directly to the cart and navigates to the checkout page, with loading state and toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and identity persistence across page reloads.",
  "frontend/src/hooks/useLeadFollowUpTrigger.ts": "Thin wrapper hook around useAutomationTriggers that exposes a single function to trigger a lead follow-up automation event by lead ID.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend actor calls, covering user profiles, roles, integration settings, sales config, and numerous other data entities via queries and mutations.",
  "frontend/src/hooks/useWebhookPost.ts": "Custom hook using React Query's useMutation to POST tool form data to a configured webhook URL, logging each request and its result.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines CSS custom properties for light and dark theme design tokens including colors, sidebar, and chart variables.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/marketplace/servicesCatalog.ts": "Defines a CatalogService interface and exports an array of 30 predefined marketplace services, each with a name and description.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that displays key stats (revenue, leads, projects, orders) using query hooks and provides navigation to management sections with a logout button.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics page showing KPI cards and charts (bar, line, pie) for revenue, active clients, conversion rate, and lead status using Recharts with mostly mock data.",
  "frontend/src/pages/AutomationPage.tsx": "Automation settings page that lets users toggle various workflow automations (WhatsApp auto-reply, proposal sending, lead follow-up, etc.) with webhook configuration status indicators.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that lists cart items with quantity controls and removal, and shows an order summary with subtotal, 18% GST, and final total.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders a checkout page with order summary, GST calculation, and payment method selection (Stripe or Razorpay), redirecting to Stripe's hosted checkout on confirmation.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Displays the client portal dashboard with navigation cards for Projects, Services, Payments, and Profile, along with user role badge and logout functionality.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Placeholder page for client onboarding that displays a card with a message indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/ClosingScriptsPage.tsx": "AI-powered sales tool that generates three tailored closing scripts based on prospect name, industry, and objection, with support for webhook posting and direct API calls.",
  "frontend/src/pages/CRMPage.tsx": "Kanban-style CRM board that displays CRM activities grouped by pipeline stage (New Lead through Lost) with color-coded columns and activity type icons.",
  "frontend/src/pages/DashboardPage.tsx": "Admin/member dashboard showing KPI cards (revenue, leads, projects, paid orders) computed from live data, plus quick-action buttons for common navigation tasks.",
  "frontend/src/pages/DataExportCenterPage.tsx": "Admin-only page that allows exporting various data modules (leads, invoices, payments, etc.) as CSV or JSON files by fetching data from the backend actor.",
  "frontend/src/pages/FollowUpMessagesPage.tsx": "AI-powered sales tool that generates a 5-message follow-up sequence for a lead based on pipeline stage and goal, with webhook and direct API integration.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays a grid of AI-powered sales tool cards (proposal generator, pricing strategy, closing scripts, etc.) with navigation to each tool's dedicated route.",
  "frontend/src/pages/InvoiceHistoryPage.tsx": "Shows a searchable list of invoices fetched from the backend and provides export options (individual PDF/text, bulk CSV, and JSON) with download utilities.",
  "frontend/src/pages/LandingPage.tsx": "Empty landing page file with no content or exports.",
  "frontend/src/pages/LeadQualificationPage.tsx": "Form-based page that collects lead details (company size, budget, urgency, etc.) and calls an AI API to return a BANT-scored qualification result with tier, strengths, risks, and next steps.",
  "frontend/src/pages/LeadsPage.tsx": "Full leads management page supporting list/grid views, filtering, sorting, lead creation via dialog, deletion, payment link generation, and integration/automation log panels.",
  "frontend/src/pages/LegalPage.tsx": "Displays a grid of required legal document cards (Privacy Policy, Terms, Refund Policy, etc.) fetched from the backend, showing content or a placeholder if not yet created.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity authentication, redirects existing users to role-based dashboards, and shows a profile setup dialog for first-time users.",
  "frontend/src/pages/ManagerDashboardPage.tsx": "Displays a manager's dashboard with lead stats (total, active, closed) and navigation cards to leads and CRM sections, with logout functionality.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a tabbed notifications page with unread/read lists, supports marking notifications as read and navigating to relevant pages based on notification type.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple error page shown after a failed payment, offering buttons to return to the cart or go to the dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Admin payments page displaying revenue stats, orders, and payment links in a tabbed layout with status indicators and loading states.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Success confirmation page shown after a completed payment that clears the cart and provides navigation to projects or the dashboard.",
  "frontend/src/pages/PricingStrategyPage.tsx": "Interactive pricing calculator that computes service prices based on base cost, urgency, complexity, and add-ons, with optional AI suggestions via webhook or API.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays detailed information for a single project (ID, status, service ID, start date) fetched by project ID from the route params.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays a grid of the authenticated user's projects fetched by client principal, showing project ID, status, associated service name, and start date with loading skeletons.",
  "frontend/src/pages/ProposalGeneratorPage.tsx": "AI-powered proposal generator page that collects client/project details, posts to a webhook and/or AI API, and renders a structured proposal with export functionality.",
  "frontend/src/pages/SalesSystemConfigPage.tsx": "Configuration page for managing and testing multiple integration credentials (webhooks, API keys, WhatsApp, Razorpay, email) with toggle switches, secret masking, and connection status badges.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Detail page for a single service showing its description, features, and three pricing tiers (Basic/Pro/Premium) with add-to-cart buttons for each tier.",
  "frontend/src/pages/ServiceRecommendationPage.tsx": "AI-driven service recommendation page where users select business types, goals, budget, and team size, then receive a recommended service with ROI projection via webhook or AI API.",
  "frontend/src/pages/ServicesPage.tsx": "Comprehensive services catalog page with static tiered services, individual packages, maintenance plans, and agency plans organized by category tabs, with search/filter and add-to-cart support.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that renders the Razorpay configuration panel and a placeholder Stripe configuration card, with an access-denied state for non-admins.",
  "frontend/src/pages/WebhookLogsPage.tsx": "Page for viewing, filtering, and clearing real-time webhook/API request logs, displaying entries in a table with status badges and search/filter controls.",
  "frontend/src/pages/WhatsAppLogsPage.tsx": "Page that fetches and displays WhatsApp message delivery logs with search/filter support and export options for CSV, JSON, and monthly reports.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that calls the backend actor to create a Stripe checkout session and returns the session ID and redirect URL.",
  "frontend/src/utils/exportUtils.ts": "Utility functions for exporting leads, invoices, and WhatsApp logs to CSV, JSON, and PDF (via HTML print), including a qualification tier helper.",
  "frontend/src/utils/formatCurrency.ts": "Provides helpers to format numbers as Indian Rupee currency strings, including a price range formatter.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based semantic color tokens, custom fonts, border radii, shadows, and background gradients.",
  "project_state.json": "Tracks the AI agency platform's build state (version 17), documenting features, known issues, architectural notes, and existing feature implementations across Lead Management CRM, Automation Dashboard, and AI Smart Systems."
}