{
  "backend/main.mo": "Main actor for the Quick Bee Agency backend, defining all data types (User, Service, Project, Lead, CRM, Payments, etc.) and canister logic with access control, Stripe/Razorpay integrations, and HTTP outcalls.",
  "backend/migration.mo": "Migration module that transforms old canister state to new state during upgrades, specifically adding default automation settings to existing IntegrationSettings records.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (automation cards, payment flows, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated text file containing one-line summaries of all frontend source files for documentation and build planning reference.",
  "frontend/index.css": "Global CSS file defining OKLCH-based design tokens for light and dark themes including background, foreground, sidebar, chart, and destructive color variables.",
  "frontend/index.html": "HTML entry point for the Quick Bee Agency React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, QueryClient provider, Internet Identity auth, and a profile setup dialog for new users.",
  "frontend/src/auth/demoCredentials.ts": "Defines hardcoded demo credentials for Admin, Manager, and Client roles and exports a validation function to match email/password pairs to a role.",
  "frontend/src/auth/useSession.ts": "React hook that manages user session state (email and role) using sessionStorage, providing saveSession and clearSession helpers.",
  "frontend/src/cart/useCart.ts": "React hook that manages a shopping cart persisted in localStorage, supporting add, remove, update quantity, clear, and total calculation.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Displays a connection/initialization error message with a retry button, rendering either inline (login context) or as a centered full-panel layout.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "Gate component that shows a loading spinner, error/timeout panel, or renders children based on bootstrap state, using a watchdog hook for timeout detection.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout component combining a background mesh image, SidebarNav, TopNav, and a scrollable main content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "Role-filtered sidebar navigation that renders menu items with icons, highlights the active route, and links to all major app sections.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar showing the app title, a notification bell with unread badge and popover list, and a user dropdown with logout functionality.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Toolbar displayed when leads are selected, providing buttons for bulk export, delete, status change, and clearing the selection.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "Dialog that allows bulk-updating the status of multiple selected leads, iterating through each and reporting success/failure counts via toasts.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "Dialog component for editing a payment link's URL and QR code, supporting QR generation via an external API or file upload, with save mutations for URL and QR code updates.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "Dialog component that displays a generated payment link with copy, open, and QR code download actions, and provides access to the EditPaymentLinkDialog for modifications.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "Dialog form for creating a new service with fields for name, description, category, three pricing tiers with features, general features, and visibility/settings, submitting via a createService mutation.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "Confirmation dialog for deleting a service by name, invoking the deleteService mutation and calling an onSuccess callback upon completion.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "Dialog form for editing an existing service's details, pricing tiers, features, and settings, pre-populated from the service prop and submitted via an updateService mutation.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "Dialog for editing a service's payment URL and QR code, supporting QR generation from a URL via an external API or image file upload, saved via the updateServicePaymentInfo mutation.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "Displays a payment information card showing a copyable payment link URL and/or a downloadable QR code image. Returns null if neither prop is provided.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "A dialog component for configuring Razorpay payment settings (enable/disable, Key ID, Order ID) for a specific service, using the useUpdateServiceRazorpay mutation to persist changes.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A settings panel card for entering and saving global Razorpay API credentials (key, secret, webhook secret) with a toggle to show/hide sensitive fields and a configured/not-configured status indicator.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "A hook that sets a 5-second timeout flag to detect bootstrap/loading timeouts, with a reset function to restart the timer.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity, and status state to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the ICP backend actor, covering entities such as users, services, projects, orders, leads, payments, and Razorpay configuration.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for a dark teal-themed design system, including utility classes for gradients and glass-panel effects.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts it to the DOM.",
  "frontend/src/marketplace/servicesCatalog.ts": "Exports a static array of 30 default service offerings (e.g., Website Development, SEO Setup) with names and descriptions for use in the marketplace.",
  "frontend/src/pages/AnalyticsPage.tsx": "Static analytics dashboard page displaying four KPI cards for Revenue, Active Clients, Conversion Rate, and Top Service with hardcoded sample data.",
  "frontend/src/pages/AutomationPage.tsx": "Automation settings page that allows users to configure and toggle integrations such as WhatsApp replies, sequence builders, proposal auto-send, payment confirmation, and project onboarding, persisting settings via backend queries.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that lists cart items with quantity controls and removal options, and shows an order summary with GST calculation and a checkout link.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that supports Stripe and conditionally Razorpay payment methods, creates a checkout session via the backend, and redirects the user to complete payment.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "A placeholder page for client onboarding that displays a card with a message indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/CRMPage.tsx": "CRM pipeline page that fetches leads and activities from the backend and displays them in a Kanban-style grid organized by sales stage.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that fetches and displays key metrics (total revenue, active projects, total orders) in stat cards with loading skeletons, using the authenticated user's profile and role.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays a grid of six rule-based business tool cards (e.g., proposal generator, pricing strategy) with icons and descriptions, with no interactive functionality yet.",
  "frontend/src/pages/LeadsPage.tsx": "Full-featured leads management page supporting create, edit, delete, bulk status changes, and payment link generation for leads, with filtering by micro-niche, channel, and status.",
  "frontend/src/pages/LegalPage.tsx": "Displays a grid of required legal document cards (Privacy Policy, Terms & Conditions, etc.), showing content if available from the backend or a placeholder if not yet created.",
  "frontend/src/pages/LoginPage.tsx": "Login page that validates demo credentials, initiates Internet Identity authentication, and conditionally shows a profile setup form for new users to enter their name and business name.",
  "frontend/src/pages/NotificationsPage.tsx": "Notifications page that lists unread and read notifications in tabs, supports marking as read, and navigates to relevant pages based on notification type.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Static payment failure page showing an error icon and message with links to return to the cart or dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays a tabbed payments page showing Stripe orders and Razorpay payment links, with loading skeletons and an edit dialog for payment links.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page that clears the cart on mount and displays a confirmation message with links to view projects or return to the dashboard.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Shows details for a single project fetched by ID from route params, displaying status and service ID in a card.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects for the authenticated user in a responsive grid with service names, status badges, and start dates.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Renders a service's full detail view with three pricing tiers, add-to-cart functionality, and admin controls for editing, deleting, and configuring payment settings.",
  "frontend/src/pages/ServicesPage.tsx": "Displays the service marketplace with category and visibility filters, falling back to default services if none are loaded, with admin controls for creating services and managing payment info.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that renders the Razorpay configuration panel, showing an access-denied card for non-admins.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that calls the backend actor to create a Stripe checkout session and returns the session ID and redirect URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, fonts, accordion animations, and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3), listing existing automation features (WhatsApp replies, sequence builder, proposal auto-send, payment confirmation, project onboarding) with their IDs, titles, and requirement references."
}