{
  "kind": "build_request",
  "title": "Fix Automation Page toggles to reliably enable/disable each automation",
  "projectName": "Quick Bee AI Growth Engine",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-77",
      "text": "Rewrite frontend/src/pages/AutomationPage.tsx so every toggle — WhatsApp Auto-Reply, Proposal Auto-Send, Lead Follow-Up Sequences, Payment Confirmation, and Project Onboarding — reads its current ON/OFF state directly from AIConfigContext (the localStorage-backed centralized config store) and writes the updated toggle state back to AIConfigContext when clicked. The toggle UI must reflect the persisted value on initial render, after page navigation, and after a full app reload. When a toggle is OFF, its corresponding automation must not fire any webhook calls, API calls, or UI triggers. When a toggle is ON, the automation is active and fires on its designated trigger condition.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix automations page toggles"
        ]
      },
      "acceptanceCriteria": [
        "Each of the five toggle switches on AutomationPage reads its initial ON/OFF state from AIConfigContext (backed by localStorage) on mount.",
        "Clicking a toggle calls the appropriate AIConfigContext setter and immediately updates both the UI and localStorage.",
        "After navigating away from AutomationPage and returning, each toggle displays the last-saved state.",
        "After a full browser refresh, each toggle displays the last-saved state.",
        "When a toggle is set to OFF, its corresponding automation (WhatsApp Auto-Reply, Proposal Auto-Send, Lead Follow-Up Sequences, Payment Confirmation, Project Onboarding) does not fire any webhook POST, API call, or UI trigger.",
        "When a toggle is set to ON, the automation becomes active and fires when its trigger condition is met."
      ]
    },
    {
      "id": "REQ-78",
      "text": "Audit frontend/src/contexts/AIConfigContext.tsx to verify that the five automation toggle fields — whatsappAutoReplyEnabled, proposalAutoSendEnabled, leadFollowUpEnabled, paymentConfirmationEnabled, and projectOnboardingEnabled — are correctly defined in the context type, initialized by reading from localStorage on provider mount, and persisted to localStorage whenever their values change or when saveConfig is called. Expose a dedicated setter (or extend the existing saveConfig/updateField API) so that AutomationPage can update each toggle independently without overwriting other config fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix automations page toggles"
        ]
      },
      "acceptanceCriteria": [
        "AIConfigContext type includes boolean fields for all five automation toggles.",
        "On provider mount the toggle values are read from localStorage and used as initial state.",
        "Updating a single toggle via the context API persists only that field's change to localStorage without resetting other config values.",
        "All consuming components (AutomationPage, useAutomationTriggers) receive the correct live toggle values from context."
      ]
    },
    {
      "id": "REQ-79",
      "text": "Audit frontend/src/hooks/useAutomationTriggers.ts to confirm that each of the five trigger functions — triggerWhatsAppAutoReply, triggerProposalAutoSend, triggerLeadFollowUp, triggerPaymentConfirmation, and triggerProjectOnboarding — reads the corresponding toggle field from AIConfigContext at call time and returns early (without making any network request) when the toggle is OFF. Each trigger must also read the correct webhook URL and API Key from AIConfigContext and include the correct headers (Content-Type: application/json, Authorization: Bearer <apiKey>) when the toggle is ON.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix automations page toggles"
        ]
      },
      "acceptanceCriteria": [
        "When the corresponding AIConfigContext toggle is OFF, calling the trigger function makes no fetch/XHR request and returns without error.",
        "When the corresponding toggle is ON and the webhook URL is configured, the trigger fires a POST with Content-Type: application/json and Authorization: Bearer <apiKey> headers.",
        "A user-visible toast error is displayed if the POST fails or the URL is not configured while the toggle is ON.",
        "Each trigger logs the attempt in WebhookLogContext regardless of success or failure."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths.",
    "All toggle state persistence must use the existing AIConfigContext and localStorage mechanism — do not introduce a separate state store.",
    "Do not change the backend schema or any Motoko files."
  ],
  "nonGoals": [
    "Adding new automation types beyond the existing five.",
    "Changes to the visual theme or unrelated UI elements.",
    "Backend changes of any kind.",
    "Fixing unrelated pages or features not directly involved in the AutomationPage toggle flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}