{
  "kind": "build_request",
  "title": "Agency Services Management — Editable Service CRUD with Packages, Add-ons & Drag-and-Drop",
  "projectName": "Quick Bee AI Growth Engine",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-83",
      "text": "Extend the Motoko backend actor in backend/main.mo to support a user-managed service data model separate from the existing static catalog. Add a new `ManagedService` record type with fields: id (Text), name (Text), shortDescription (Text), detailedDescription (Text), category (Text), pricingType (variant { Fixed; Hourly; Custom }), basePrice (Nat), deliveryTime (Text), imageUrl (Text), features ([Text]), packages ([ServicePackage]), addOns ([ServiceAddOn]), customRequirementLabel (Text), quantityEnabled (Bool), isVisible (Bool), sortOrder (Nat), createdAt (Int), updatedAt (Int), isUserCreated (Bool). Add a `ServicePackage` record type with: name (Text), price (Nat), deliveryTime (Text), features ([Text]). Add a `ServiceAddOn` record type with: name (Text), price (Nat), description (Text). Implement CRUD update functions: `createManagedService`, `updateManagedService`, `deleteManagedService` (only allow deletion when `isUserCreated` is true), `duplicateManagedService`, `reorderManagedServices` (accepts an ordered list of ids), and `getManagedServices`. All operations must validate required fields (name non-empty, basePrice >= 0) and return a Result type. Existing service data and backend functions must remain unchanged.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "securely stored in a database",
          "edit, delete (only new services)",
          "fully integrated without breaking the existing system"
        ]
      },
      "acceptanceCriteria": [
        "ManagedService, ServicePackage, and ServiceAddOn types are defined in main.mo.",
        "createManagedService, updateManagedService, deleteManagedService, duplicateManagedService, reorderManagedServices, and getManagedServices are callable from the frontend.",
        "deleteManagedService returns an error when called on a service where isUserCreated is false.",
        "Validation rejects empty service names and negative prices.",
        "Existing service-related actor functions are not modified or removed."
      ]
    },
    {
      "id": "REQ-84",
      "text": "Add React Query mutation and query hooks for the new managed-service backend functions to frontend/src/hooks/useQueries.ts. Expose: `useGetManagedServices` (query), `useCreateManagedService` (mutation, invalidates managed-services cache on success), `useUpdateManagedService` (mutation, invalidates on success), `useDeleteManagedService` (mutation, invalidates on success), `useDuplicateManagedService` (mutation, invalidates on success), and `useReorderManagedServices` (mutation, invalidates on success). Each hook must follow the existing pattern in useQueries.ts — check actor availability, wrap the actor call, and handle errors with toast notifications.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "securely stored in a database",
          "fully integrated without breaking the existing system"
        ]
      },
      "acceptanceCriteria": [
        "useGetManagedServices returns the list of ManagedService objects from the backend.",
        "useCreateManagedService, useUpdateManagedService, useDeleteManagedService, useDuplicateManagedService, and useReorderManagedServices are available and invalidate the managed-services query key on success.",
        "Hooks follow the existing actor-availability guard pattern in useQueries.ts.",
        "TypeScript types for ManagedService, ServicePackage, and ServiceAddOn are declared and exported from useQueries.ts or a shared types file."
      ]
    },
    {
      "id": "REQ-85",
      "text": "Create a new page at route /service-management (frontend/src/pages/ServiceManagementPage.tsx), accessible from the sidebar navigation under a 'Services' group. This page is the Agency Services Management hub and must: (1) display a prominent 'Add New Service' button at the top that opens a create-service dialog; (2) fetch and render all user-created managed services using `useGetManagedServices`; (3) render each managed service as a card showing the service name, category, pricing type, base price (INR formatted), delivery time, visibility badge (Active/Hidden), and action buttons (Edit, Duplicate, Delete, Preview, drag handle); (4) support drag-and-drop reordering of service cards using a library-agnostic approach (mouse/touch event handlers or a lightweight DnD utility) — on drop, call `useReorderManagedServices` with the new ordered id list; (5) include a visibility toggle on each card that calls `useUpdateManagedService` to flip `isVisible`; (6) show a loading skeleton while data is fetching and an empty-state illustration with a call-to-action when no services exist; (7) be fully responsive and mobile-friendly using the existing dark-gold Tailwind theme (charcoal backgrounds, gold accents, rounded-xl cards). Register the route /service-management in App.tsx nested under the authenticated shell route.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "editable Agency Services Management section in my dashboard",
          "drag-and-drop",
          "enable or disable visibility",
          "mobile-friendly"
        ]
      },
      "acceptanceCriteria": [
        "Route /service-management is registered in App.tsx and renders ServiceManagementPage.",
        "Page renders a card for every managed service returned by useGetManagedServices.",
        "Drag-and-drop reorder works; dropping a card calls useReorderManagedServices with the updated order.",
        "Visibility toggle on each card calls useUpdateManagedService and reflects the new state immediately.",
        "Empty state is shown when no managed services exist.",
        "Page is mobile-responsive and uses the dark-gold theme.",
        "Loading skeleton is displayed while data is fetching."
      ]
    },
    {
      "id": "REQ-86",
      "text": "Create a multi-step Create/Edit Service dialog (frontend/src/components/services/ManagedServiceFormDialog.tsx) used by both the 'Add New Service' button and the 'Edit' action on ServiceManagementPage. The dialog must have the following tabs/steps: (1) Basic Info — service name (required), short description, detailed description, category (dropdown: SEO, Web Design, Ads, Branding, AI Automation, App Development, Digital Marketing, Custom), pricing type (radio: Fixed / Hourly / Custom Quote), base price (INR number input, shown only for Fixed/Hourly), delivery time (text), image URL or icon picker; (2) Features — a dynamic bullet-point list where users can add, edit, and remove feature items; (3) Packages — three expandable sections for Basic, Standard, and Premium packages, each with its own name, price (INR), delivery time, and features list; optional add-ons section below with add/remove rows (name, price, description); (4) Settings — custom requirement label (text, e.g. 'Describe your project'), quantity selector toggle (on/off), visibility toggle (on/off). On submit, call `useCreateManagedService` (for new) or `useUpdateManagedService` (for edit) with the form data. Show inline validation errors for required fields. Show a loading spinner on the submit button while the mutation is in-flight. Close the dialog and show a success toast on completion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "service name, short and detailed description, category, pricing type (fixed, hourly, or custom), price, delivery time, image/icon, and features list",
          "service packages (Basic, Standard, Premium) with different prices and features",
          "optional add-ons, custom requirement fields, quantity selection"
        ]
      },
      "acceptanceCriteria": [
        "Dialog opens from the 'Add New Service' button with all fields blank.",
        "Dialog opens from the 'Edit' button pre-populated with the existing service's data.",
        "All four tabs (Basic Info, Features, Packages, Settings) render and are navigable.",
        "Features tab allows adding, editing, and removing bullet-point items.",
        "Packages tab shows Basic, Standard, and Premium sections each with price, delivery time, and features.",
        "Add-ons section allows adding/removing rows with name, price, and description.",
        "Submitting with an empty service name shows an inline validation error.",
        "Successful create calls useCreateManagedService; successful edit calls useUpdateManagedService.",
        "Dialog closes and a success toast is shown after a successful save.",
        "Submit button shows a loading spinner during mutation."
      ]
    },
    {
      "id": "REQ-87",
      "text": "Implement the Duplicate and Delete actions for managed services on ServiceManagementPage. For Duplicate: clicking the Duplicate button on a service card calls `useDuplicateManagedService` with the service id, appends ' (Copy)' to the duplicated service's name, and adds it to the list immediately via cache invalidation. For Delete: clicking the Delete button opens a confirmation dialog (reuse or extend the existing ServiceDeleteDialog pattern) that warns the user the action is permanent; on confirmation, calls `useDeleteManagedService`; if the backend returns an error because `isUserCreated` is false, display a toast error: 'This service is part of the original catalog and cannot be deleted.' On successful deletion, remove the card from the list via cache invalidation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "delete (only new services)",
          "duplicate"
        ]
      },
      "acceptanceCriteria": [
        "Duplicate button creates a copy of the service with ' (Copy)' appended to the name.",
        "Duplicate is reflected in the list immediately after the mutation succeeds.",
        "Delete button opens a confirmation dialog before proceeding.",
        "Confirming delete calls useDeleteManagedService.",
        "If the backend rejects the delete (isUserCreated = false), a toast error is shown: 'This service is part of the original catalog and cannot be deleted.'",
        "Successfully deleted service is removed from the UI without a page reload."
      ]
    },
    {
      "id": "REQ-88",
      "text": "Implement a Service Preview modal (frontend/src/components/services/ManagedServicePreviewModal.tsx) that renders a read-only, client-facing view of a managed service before publishing. The preview must display: service name, short and detailed description, category badge, pricing type and base price (INR formatted), delivery time, features bullet list, all package cards (Basic/Standard/Premium) with their prices and features, and available add-ons. Include a dynamic price calculator section that shows the base price and recalculates the total in real time as the user selects add-ons (checkboxes) and adjusts quantity (if `quantityEnabled` is true). Display the custom requirement label as a disabled text area placeholder. The modal must use the existing dark-gold Tailwind theme and be fully responsive. A 'Close' button must dismiss the modal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "preview before publishing",
          "automatic price updates based on selected options",
          "quantity selection"
        ]
      },
      "acceptanceCriteria": [
        "Preview modal opens from the 'Preview' button on a service card.",
        "All service fields are rendered in a read-only client-facing layout.",
        "Package cards (Basic/Standard/Premium) display their individual prices and features.",
        "Add-on checkboxes update the total price dynamically when checked/unchecked.",
        "Quantity input (if quantityEnabled = true) multiplies the selected price and updates the total.",
        "Custom requirement label appears as a disabled placeholder text area.",
        "Modal is responsive and styled with the dark-gold theme.",
        "Close button dismisses the modal."
      ]
    },
    {
      "id": "REQ-89",
      "text": "Add a 'Service Management' link to the sidebar navigation (frontend/src/components/layout/SidebarNav.tsx) under a 'Services' group or adjacent to the existing Services link. The link must point to /service-management and be visible to all users (no role gate). Also add a simple analytics sub-section at the bottom of ServiceManagementPage that displays, for each managed service: a 'Views' count and a 'Purchases' count, read from localStorage counters that are incremented (a) when the preview modal is opened (views) and (b) when a managed service's 'Buy Now' action is triggered (purchases). Display these counts as small stat badges on each service card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "simple analytics to track most viewed or purchased services"
        ]
      },
      "acceptanceCriteria": [
        "'Service Management' nav link appears in SidebarNav and navigates to /service-management.",
        "Views counter increments in localStorage each time a service's preview modal is opened.",
        "Purchases counter increments in localStorage each time a 'Buy Now' action is triggered for a managed service.",
        "Each service card on ServiceManagementPage shows a 'Views: N' and 'Purchases: N' badge.",
        "Counters persist across page navigation (localStorage-backed)."
      ]
    }
  ],
  "constraints": [
    "Existing services data (masterServiceCatalog.ts, individualPackages.ts, maintenancePlans.ts, agencyPlans.ts) and the static ServicesPage catalog must not be modified or removed.",
    "The deleteManagedService backend function must refuse deletion of any service where isUserCreated is false.",
    "All new frontend files must use the existing dark-gold Tailwind theme tokens (charcoal backgrounds, gold/amber accents, rounded-xl).",
    "Do not edit any file listed under frontend.immutablePaths.",
    "All Motoko logic must remain in backend/main.mo (single-actor architecture)."
  ],
  "nonGoals": [
    "Replacing or migrating the existing static service catalog on ServicesPage.",
    "Third-party drag-and-drop library installation — use native browser events or existing utilities.",
    "Real-time multi-user collaboration on service editing.",
    "External image hosting or CDN integration — image URL field accepts any valid URL string.",
    "Stripe or Razorpay payment flow changes — existing checkout integration is out of scope for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}