{
  "kind": "build_request",
  "title": "Add Full Quick Bee Agency Service Catalog with Direct Payment & Fix Login Sign In Button",
  "projectName": "Quick Bee Agency",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Populate the Services page with the complete Quick Bee Agency 2026 Master Service Price List. Organise all entries into 7 categories: (1) Web Development Services — 12 services with Student/Business/Premium tiers; (2) App Development Services — 8 services with Student/Business/Premium tiers; (3) AI Automation Services — 8 services with Starter/Growth/Enterprise tiers; (4) Digital Marketing & Growth — 8 services with Student/Business/Premium tiers; (5) Branding & Creative Services — 7 services with Starter/Business/Premium tiers; (6) SaaS & Advanced Tech — 8 services with Business/Advanced/Enterprise tiers; (7) Business Setup & Systems — 6 services with Starter/Growth/Premium tiers. Each service card must display the service name, category, all three pricing tiers with their INR (₹) prices, and the list of 16 features where provided in the user's input. The page must include a category filter/tab bar so users can browse by category. Prices must be formatted in Indian Rupee notation (e.g., ₹1,20,000).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "💻 1. Web Development Services",
          "📱 2. App Development Services",
          "🤖 3. AI Automation Services",
          "📊 4. Digital Marketing & Growth",
          "🎨 5. Branding & Creative Services",
          "💼 6. SaaS & Advanced Tech",
          "🛠 7. Business Setup & Systems"
        ]
      },
      "acceptanceCriteria": [
        "All 7 service categories are displayed with their correct services and INR tier prices",
        "A category filter tab bar allows browsing by individual category",
        "Each service card shows name, category, all pricing tiers, and the 16 features list",
        "Prices are formatted in Indian Rupee notation with correct comma separators"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add the 30 individual service packages (Website Development ₹999, Sales Funnel Setup ₹1,099, WhatsApp Automation ₹1,199, AI Chatbot Setup ₹1,299, Landing Pages ₹1,399, SEO Setup ₹1,499, Social Media Management ₹1,599, Instagram Growth System ₹1,699, Lead Generation System ₹1,799, Branding Kit ₹1,899, Logo Design ₹1,999, Video Editing ₹2,099, AI Content Creation ₹2,199, Email Marketing Setup ₹2,299, LinkedIn Outreach System ₹2,399, E-commerce Store Setup ₹2,499, No-Code App Development ₹2,599, Automation Setup ₹2,699, CRM Setup ₹2,799, AI Proposal Generator ₹2,899, Pricing Strategy Consulting ₹2,999, Funnel Optimization ₹3,099, Copywriting Service ₹3,199, Reels Script Creation ₹3,299, AI Image Generation ₹3,399, T-Shirt POD Setup ₹3,499, Etsy Automation ₹3,599, Affiliate Marketing System ₹3,699, Notion Dashboard Setup ₹3,799, Analytics Dashboard Setup ₹3,899) to the Services page as a separate 'Individual Packages' section or tab. Each package card must show: package name, flat INR price, category, sub-category, and its 16 listed features as a bullet list expandable on click.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1️⃣ Website Development – ₹999",
          "2️⃣ Sales Funnel Setup – ₹1,099",
          "1️⃣2️⃣ Analytics Dashboard Setup – ₹3,899"
        ]
      },
      "acceptanceCriteria": [
        "All 30 individual packages appear on the Services page under an 'Individual Packages' section or tab",
        "Each card displays the flat price, category, sub-category, and 16 features",
        "Features list is expandable/collapsible on the card",
        "Cards are sorted by price ascending by default"
      ]
    },
    {
      "id": "REQ-27",
      "text": "Add the Monthly Maintenance & Subscription plans to the Services page as a dedicated 'Maintenance Plans' section or tab. Include all five plan categories: (1) Website Maintenance — Basic (₹999–₹2,999/mo), Business (₹3,999–₹7,999/mo), Premium/AI/3D (₹10,000–₹35,000/mo); (2) App Maintenance — Basic (₹2,999–₹6,999/mo), Growth (₹8,000–₹20,000/mo), Enterprise (₹25,000–₹75,000/mo); (3) AI Automation Maintenance — Basic (₹2,999–₹7,999/mo), Advanced (₹10,000–₹30,000/mo); (4) Marketing & Growth Retainer — Starter (₹4,999–₹12,000/mo), Growth (₹15,000–₹40,000/mo), Premium (₹50,000–₹1,50,000/mo); (5) SaaS & Backend Retainer — Business (₹15,000–₹35,000/mo), Enterprise (₹40,000–₹1,20,000/mo). Each plan card must list its included features as provided in the user's input.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "🔁 Monthly Maintenance & Subscription (2026 Specific Model)",
          "💻 1. Website Maintenance Plans",
          "📱 2. App Maintenance Plans",
          "🤖 3. AI Automation Maintenance",
          "📊 4. Marketing & Growth Retainer",
          "💼 5. SaaS & Backend Retainer"
        ]
      },
      "acceptanceCriteria": [
        "All maintenance plan categories and tiers are displayed with monthly price ranges",
        "Each plan card lists its included features",
        "Plans are grouped clearly under their respective categories",
        "A 'Maintenance Plans' section or tab is accessible from the Services page navigation"
      ]
    },
    {
      "id": "REQ-28",
      "text": "Add the 3 Master Agency Plans (Spark, Surge, Titan) to the Services page as a prominently styled 'Agency Plans' section or tab. Display: Spark Plan (₹4,999–₹25,000, Student/Beginner/Idea Stage), Surge Plan (₹30,000–₹1,20,000, Local & National Business Growth), Titan Plan (₹1,50,000–₹5,00,000+, National/Global/Enterprise Clients). Style each plan as a highlighted pricing card with a distinct colour badge (green for Spark, blue for Surge, purple for Titan) matching the emoji indicators in the source data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "💎 3 MASTER AGENCY PLANS (Positioned for Sales)",
          "🟢 Spark Plan",
          "🔵 Surge Plan",
          "🟣 Titan Plan"
        ]
      },
      "acceptanceCriteria": [
        "Three master agency plan cards appear in an 'Agency Plans' section with the correct price ranges and tier descriptions",
        "Spark card has a green badge, Surge has blue, Titan has purple",
        "Plans are visually prominent and distinct from individual service cards"
      ]
    },
    {
      "id": "REQ-29",
      "text": "On every service card, pricing tier card, maintenance plan card, individual package card, and agency plan card on the Services page, add a direct 'Buy Now' or 'Select & Pay' button. When clicked, this button must: (1) add the selected service/plan at the chosen price tier to the cart (using the existing useCart hook), then navigate to the CheckoutPage; OR (2) if Razorpay is configured in the centralized config store, initiate a Razorpay payment flow directly for the selected item's price. For tiered services (Student/Business/Premium), display a tier selector (radio buttons or segmented control) on the card so the user can choose which tier price to purchase before clicking the button. The selected tier and price must be passed through to the cart/checkout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "give all the options need & to pay by selecting directly"
        ]
      },
      "acceptanceCriteria": [
        "Every service/package/plan card has a 'Buy Now' or 'Select & Pay' button",
        "Tiered service cards show a tier selector (Student/Business/Premium or equivalent) before the button",
        "Clicking the button adds the item at the selected tier price to the cart and navigates to checkout",
        "If Razorpay is configured, the Razorpay payment flow is initiated directly",
        "Selected tier label and price are correctly passed to cart/checkout"
      ]
    },
    {
      "id": "REQ-30",
      "text": "Fix the Sign In button on the LoginPage (frontend/src/pages/LoginPage.tsx) so that clicking it correctly triggers the Internet Identity authentication flow, waits for authentication to complete, and then redirects the authenticated user to the appropriate dashboard route. The button must show a loading/spinner state while the authentication is in progress. If authentication fails or is cancelled, display a user-visible error message. Ensure the button is not disabled or unbound from its click handler.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the sign in button is not working on login screen , fix it"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Sign In button on the login screen triggers the Internet Identity login flow",
        "A loading/spinner state is shown on the button while authentication is in progress",
        "After successful authentication, the user is redirected to their dashboard",
        "If authentication fails or is cancelled, a visible error message is shown",
        "The button is fully functional and not disabled by default"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All price values must be stored and displayed in Indian Rupees (₹) exactly as provided",
    "Use the existing useCart hook for cart operations — do not create a parallel cart system",
    "Internet Identity is the only supported authentication method — do not introduce third-party auth"
  ],
  "nonGoals": [
    "Building a new backend schema for the service catalog — seed data may be hardcoded on the frontend or persisted via existing backend service mutations",
    "Implementing a new payment gateway beyond Razorpay and the existing Stripe integration",
    "Creating new authentication mechanisms beyond Internet Identity"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}