{
  "kind": "build_request",
  "title": "Rebuild AI Sales System Automation Page (Version 14 Features)",
  "projectName": "Quick Bee Agency",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rebuild the AutomationPage to feature a dedicated 'AI Sales System' section as the primary focus, displaying clearly organized panels for: (1) Sales System Configuration (API endpoint + API key input with connection test), (2) Automation Rules toggles (e.g., WhatsApp auto-reply, proposal auto-send, lead follow-up), and (3) Integration status indicators. The page must use the teal-green + black theme consistently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Rebuild Version 14's features fresh (the AI sales system automation page)"
        ]
      },
      "acceptanceCriteria": [
        "AutomationPage renders three distinct sections: Sales System Config, Automation Rules, and Integration Status",
        "Sales System Config panel contains fields for API endpoint URL and API key with a 'Test Connection' button",
        "Automation Rules section shows toggles for at least: WhatsApp auto-reply, proposal auto-send, and lead follow-up",
        "All UI elements use the teal-green + black color theme",
        "Page is accessible from the sidebar navigation"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Rebuild the ServiceRecommendationPage as a fully functional AI-powered service recommendation tool. The page must collect: business type, budget range, and business goals from the user via a form, then call the configured AI/API endpoint (from SalesSystemConfig) to return and display tailored service recommendations with name, description, and a suggested pricing tier. If no API is configured, show a fallback rule-based recommendation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the AI sales system automation page"
        ]
      },
      "acceptanceCriteria": [
        "Form collects business type (dropdown or text), budget range (slider or input), and goals (multi-select or textarea)",
        "Submitting the form calls the configured API endpoint if set, otherwise uses rule-based logic",
        "Recommendations are displayed as cards showing service name, description, and suggested tier",
        "Loading state is shown while the recommendation is being fetched",
        "Error state is shown if the API call fails, with a fallback to rule-based results"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Rebuild the ProposalGeneratorPage as a fully functional AI-powered proposal creation tool. The page must include a form with fields for: client name, client business type, selected services, project scope/notes, and budget. On submission, it calls the configured AI/API endpoint to generate a professional proposal. The generated proposal must be displayed in a formatted preview and support downloading as a print-formatted PDF.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the AI sales system automation page"
        ]
      },
      "acceptanceCriteria": [
        "Form includes fields for client name, business type, service selection, scope notes, and budget",
        "Submitting calls the configured AI API endpoint if available, otherwise generates a template-based proposal",
        "Generated proposal is displayed in a styled preview panel",
        "A 'Download PDF' button triggers a print-formatted PDF download of the proposal",
        "Loading and error states are handled gracefully"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the backend Motoko actor stores and retrieves the Sales System integration configuration (API endpoint URL and API key) per user/admin, and exposes query and update functions for getting and setting this configuration. This data should persist across sessions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Rebuild Version 14's features fresh (the AI sales system automation page)"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a `getSalesSystemConfig` query function returning the stored endpoint URL and API key",
        "Backend exposes a `setSalesSystemConfig` update function accepting an endpoint URL and API key",
        "Only admin/manager roles can set the configuration",
        "Configuration persists across canister upgrades"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a `useUpdateSalesSystemConfig` mutation and `useGetSalesSystemConfig` query in `frontend/src/hooks/useQueries.ts` to connect the frontend Sales System Config panel to the backend storage functions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "`useGetSalesSystemConfig` fetches and caches the stored API endpoint and key",
        "`useUpdateSalesSystemConfig` calls the backend update function and invalidates the config cache on success",
        "SalesSystemConfigDialog uses these hooks for loading and saving config",
        "Toast notification confirms successful save or reports error"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add sidebar navigation entries for 'Service Recommendation' and 'Proposal Generator' pages under an 'AI Sales Tools' group or within the existing automation section, visible to Admin and Manager roles. Ensure the teal-green + black theme is applied to nav items consistently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Sidebar shows links to '/service-recommendation' and '/proposal-generator' routes",
        "Links are only visible to Admin and Manager roles",
        "Active state highlight uses teal-green brand color",
        "Routes are registered in App.tsx and render the correct pages"
      ]
    }
  ],
  "constraints": [
    "Use the existing teal-green + black color theme (tailwind.config.js brand palette) consistently across all new/rebuilt pages",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All Motoko logic must remain in backend/main.mo as a single actor",
    "Frontend API calls to AI services must use the user-configured endpoint from SalesSystemConfig, not hardcoded URLs"
  ],
  "nonGoals": [
    "Rebuilding any other pages beyond AutomationPage, ServiceRecommendationPage, and ProposalGeneratorPage",
    "Changing the teal-green + black visual theme introduced in Version 16",
    "Adding new payment or CRM features",
    "Real-time websocket features",
    "Mobile-specific layouts"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}