{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-02-26T14:54:09.872Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 8,
    "implemented": 0,
    "items": [
      {
        "id": "REQ-1",
        "summary": "Fix the API settings configuration form so that all fields — API Endpoint, API Key, WhatsApp Token, Razorpay Key ID, Razorpay Secret, Email API Key, CRM Webhook URL, and Automation Webhook URL — are properly persisted to state/storage and included in all outgoing requests. Values must survive component re-renders and page navigation. Use a centralized config store (e.g., React context or persistent state via localStorage) so every module can read and use these values reliably.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/contexts/ApiConfigContext.tsx",
          "frontend/src/main.tsx",
          "frontend/src/components/settings/ApiSettingsPanel.tsx",
          "frontend/src/pages/SettingsPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-2",
        "summary": "Fix all webhook trigger functions (form submission, lead qualification, payment success, project creation) to correctly send HTTP POST requests with proper JSON body and headers. Each trigger must include: Content-Type: application/json header, Authorization header using the saved API Key where required, and a structured JSON payload relevant to the event type. Use the saved CRM Webhook URL for CRM events and Automation Webhook URL for automation events from the API settings store.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/utils/webhookTriggers.ts",
          "frontend/src/pages/LeadsPage.tsx",
          "frontend/src/pages/CheckoutPage.tsx",
          "frontend/src/pages/ProjectsPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-3",
        "summary": "Add comprehensive error handling, logging, and response status validation to all webhook and API calls. For every outgoing request: catch network errors and show a user-visible error message specifying which webhook/API failed, log request details (URL, payload, timestamp) and response details (status, body) to a visible in-dashboard Webhook Log panel, confirm HTTP 200/2xx as success and display a success indicator, show a distinct error state for non-2xx responses including the status code and response message.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/contexts/WebhookLogContext.tsx",
          "frontend/src/main.tsx",
          "frontend/src/utils/webhookTriggers.ts",
          "frontend/src/components/automation/WebhookLogPanel.tsx",
          "frontend/src/pages/AutomationPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-4",
        "summary": "Fix automation toggles on the Automation Page so each one truly enables or disables its corresponding feature. When a toggle is OFF, its automation must not fire (no webhook calls, no API calls, no UI triggers). When ON, the automation must be active. The following toggles must be fixed: WhatsApp Auto-Reply, Proposal Auto-Send (when lead is qualified), Lead Follow-Up Sequences, Payment Confirmation via Razorpay webhook, and Project Onboarding after payment success. Toggle state must persist across sessions.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/contexts/AutomationConfigContext.tsx",
          "frontend/src/main.tsx",
          "frontend/src/pages/AutomationPage.tsx",
          "frontend/src/utils/webhookTriggers.ts",
          "frontend/src/pages/LeadsPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-5",
        "summary": "Fix the AI Smart Systems modules (Service Recommendation, Proposal Generator, Pricing Strategy, Closing Scripts, Follow-Up Messages, Lead Qualification) so that AI responses from OpenRouter/OpenAI are correctly fetched and displayed in the dashboard. Each module must: build the correct API request using the saved API Endpoint and API Key, send the prompt with proper OpenAI-compatible JSON body format, handle the response and extract the generated text, and render the AI response in the relevant result area of the page.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/utils/aiClient.ts",
          "frontend/src/pages/ServiceRecommendationPage.tsx",
          "frontend/src/pages/ProposalGeneratorPage.tsx",
          "frontend/src/pages/PricingStrategyPage.tsx",
          "frontend/src/pages/generators/ClosingScriptsPage.tsx",
          "frontend/src/pages/generators/FollowUpMessagesPage.tsx",
          "frontend/src/pages/generators/LeadQualificationPage.tsx",
          "frontend/src/App.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-6",
        "summary": "Fix Razorpay payment webhook handling and WhatsApp auto-reply triggers. For Razorpay: when a payment success event occurs (or is simulated), fire the Automation Webhook URL with a structured payment payload and update the lead/project status accordingly. For WhatsApp Auto-Reply: when the WhatsApp Auto-Reply toggle is ON and a lead is created or updated, send a POST request to the saved Automation Webhook URL with WhatsApp message payload (using the saved WhatsApp Token as authorization). Both flows must validate the webhook URL is configured before attempting.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/utils/razorpayWebhookHandler.ts",
          "frontend/src/pages/PaymentSuccessPage.tsx",
          "frontend/src/utils/whatsAppAutoReply.ts",
          "frontend/src/pages/LeadsPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-7",
        "summary": "Ensure PDF and CSV exports work correctly across all dashboard modules including Leads, AI Smart Systems results, WhatsApp Logs, Invoices, and the Data Export Center. Fix any broken export functions: CSV exports must produce valid comma-separated files with headers and download to the user's browser; PDF exports must generate a formatted document and trigger a browser download. Each export button must show a loading state while generating and an error message if it fails.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/utils/exportUtils.ts",
          "frontend/src/pages/LeadsPage.tsx",
          "frontend/src/pages/ServiceRecommendationPage.tsx",
          "frontend/src/pages/ProposalGeneratorPage.tsx",
          "frontend/src/pages/PricingStrategyPage.tsx",
          "frontend/src/pages/WhatsAppLogsPage.tsx",
          "frontend/src/pages/InvoiceHistoryPage.tsx",
          "frontend/src/pages/DataExportCenterPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-8",
        "summary": "Add a real-time connection status indicator for each configured integration (API Endpoint, CRM Webhook URL, Automation Webhook URL, WhatsApp, Razorpay). Each indicator must show 'Connected' (green) when the last call to that endpoint returned a 2xx response, 'Error' (red) when the last call failed, and 'Not Configured' (grey) when the URL/key is empty. Add a 'Test Connection' button for CRM Webhook URL and Automation Webhook URL that sends a test POST payload and updates the indicator in real time.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/contexts/ConnectionStatusContext.tsx",
          "frontend/src/main.tsx",
          "frontend/src/components/settings/ConnectionStatusIndicator.tsx",
          "frontend/src/components/settings/TestConnectionButton.tsx",
          "frontend/src/components/settings/ApiSettingsPanel.tsx",
          "frontend/src/utils/webhookTriggers.ts",
          "frontend/src/utils/aiClient.ts",
          "frontend/src/pages/AutomationPage.tsx"
        ],
        "matchedFiles": []
      }
    ]
  },
  "changedFiles": [
    "build-request.json",
    "feature_evidence.json",
    "frontend-implementation-plan.json",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}