{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Automation Page toggles to reliably enable/disable each automation",
  "requirements": [
    {
      "id": "REQ-77",
      "summary": "Rewrite AutomationPage.tsx to read and write toggle state directly from AIConfigContext with proper localStorage persistence and immediate UI reflection",
      "acceptanceCriteria": [
        "Each of the five toggle switches on AutomationPage reads its initial ON/OFF state from AIConfigContext (backed by localStorage) on mount.",
        "Clicking a toggle calls the appropriate AIConfigContext setter and immediately updates both the UI and localStorage.",
        "After navigating away from AutomationPage and returning, each toggle displays the last-saved state.",
        "After a full browser refresh, each toggle displays the last-saved state.",
        "When a toggle is set to OFF, its corresponding automation (WhatsApp Auto-Reply, Proposal Auto-Send, Lead Follow-Up Sequences, Payment Confirmation, Project Onboarding) does not fire any webhook POST, API call, or UI trigger.",
        "When a toggle is set to ON, the automation becomes active and fires when its trigger condition is met."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AutomationPage.tsx",
          "operation": "modify",
          "description": "Rewrite the AutomationPage component to use AIConfigContext for reading and writing all five automation toggle states. Each toggle (WhatsApp Auto-Reply via whatsappAutoReplyEnabled, Proposal Auto-Send via proposalAutoSendEnabled, Lead Follow-Up Sequences via leadFollowUpEnabled, Payment Confirmation via paymentConfirmationEnabled, and Project Onboarding via projectOnboardingEnabled) must read its initial value from the context on mount and call the appropriate context setter when clicked. Ensure the UI reflects the persisted state immediately and after page navigation or full reload. Remove any local state management for toggles and rely exclusively on AIConfigContext."
        }
      ]
    },
    {
      "id": "REQ-78",
      "summary": "Audit and fix AIConfigContext to ensure all five automation toggle fields are properly typed, initialized from localStorage, and persisted on every update",
      "acceptanceCriteria": [
        "AIConfigContext type includes boolean fields for all five automation toggles.",
        "On provider mount the toggle values are read from localStorage and used as initial state.",
        "Updating a single toggle via the context API persists only that field's change to localStorage without resetting other config values.",
        "All consuming components (AutomationPage, useAutomationTriggers) receive the correct live toggle values from context."
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/AIConfigContext.tsx",
          "operation": "modify",
          "description": "Audit the AIConfigContext to verify that the AIConfig type includes boolean fields for whatsappAutoReplyEnabled, proposalAutoSendEnabled, leadFollowUpEnabled, paymentConfirmationEnabled, and projectOnboardingEnabled. Ensure the provider initializes these fields by reading from localStorage on mount (using a default value of false if not present). Verify that the saveConfig or updateField functions correctly persist individual toggle changes to localStorage without overwriting other config fields. Expose individual setter functions or a generic updateField helper so that AutomationPage can update each toggle independently. Ensure all changes trigger a re-render and persist immediately."
        }
      ]
    },
    {
      "id": "REQ-79",
      "summary": "Audit useAutomationTriggers to ensure each trigger function checks its corresponding toggle from AIConfigContext and returns early when disabled",
      "acceptanceCriteria": [
        "When the corresponding AIConfigContext toggle is OFF, calling the trigger function makes no fetch/XHR request and returns without error.",
        "When the corresponding toggle is ON and the webhook URL is configured, the trigger fires a POST with Content-Type: application/json and Authorization: Bearer <apiKey> headers.",
        "A user-visible toast error is displayed if the POST fails or the URL is not configured while the toggle is ON.",
        "Each trigger logs the attempt in WebhookLogContext regardless of success or failure."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAutomationTriggers.ts",
          "operation": "modify",
          "description": "Audit the useAutomationTriggers hook to confirm that each of the five trigger functions (triggerWhatsAppAutoReply, triggerProposalAutoSend, triggerLeadFollowUp, triggerPaymentConfirmation, triggerProjectOnboarding) reads its corresponding toggle field from AIConfigContext at call time. If the toggle is OFF, the function must return early without making any network request. When the toggle is ON, verify the function reads the correct webhook URL and API key from AIConfigContext, constructs the POST request with Content-Type: application/json and Authorization: Bearer <apiKey> headers, and logs the attempt to WebhookLogContext. Display a toast error if the URL is missing or the request fails while the toggle is ON."
        }
      ]
    }
  ]
}