{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Internet Identity login flow — deep diagnosis and full rewrite",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Complete rewrite of LoginPage.tsx to ensure the Sign In button is always clickable, calls login() from useInternetIdentity hook, displays loading state, redirects to role-based dashboard on success, and shows inline error messages on failure",
      "acceptanceCriteria": [
        "Visiting the login page shows the Sign In with Internet Identity button in a clickable, enabled state immediately",
        "Clicking the button invokes the Internet Identity popup/flow without any error",
        "A spinner or loading indicator is visible while authentication is in progress",
        "After successful authentication, the user is automatically redirected to the appropriate dashboard route",
        "If the user cancels or authentication fails, an inline error message is shown on the login page",
        "No disabled prop, loading guard, or actor-initialization check blocks the button from being clickable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Rewrite the entire LoginPage component to ensure the Sign In with Internet Identity button is never disabled and calls login() from the useInternetIdentity hook immediately on click. Remove any guards or conditions that prevent the button from being clickable. Display a visible loading spinner while isLoggingIn is true. Add a useEffect that watches isAuthenticated and identity to trigger role-based navigation once authentication completes. Implement inline error state display if login() throws or authentication is cancelled. Ensure the component imports useInternetIdentity from frontend/src/hooks/useInternetIdentity.ts and useNavigate from @tanstack/react-router. Query the user's role using useGetCallerUserRole from frontend/src/hooks/useQueries.ts and redirect admin users to /admin-dashboard, manager users to /manager-dashboard, client users to /client-dashboard, and fallback to /dashboard for others. If role is still loading after authentication, redirect to /dashboard immediately rather than waiting. Keep the profile setup dialog logic intact but ensure it only appears after successful authentication and role determination."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Rewrite BootstrapGate.tsx to never block the LoginPage UI, allowing unauthenticated users to interact with the full login page regardless of actor or identity initialization state",
      "acceptanceCriteria": [
        "Opening the app when unauthenticated immediately renders the LoginPage with no loading spinner blocking it",
        "BootstrapGate does not render a spinner or error panel on the login route",
        "BootstrapGate still shows a loading state for authenticated users accessing protected routes before the actor is ready",
        "The Sign In button on LoginPage is interactable before the ICP actor has finished initializing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/bootstrap/BootstrapGate.tsx",
          "operation": "modify",
          "description": "Rewrite BootstrapGate to detect when the current route is the login page (use useRouter or useLocation from @tanstack/react-router to check if pathname is '/login' or '/'). When on the login route or when the user is unauthenticated (identity is null), render children directly without any loading spinner, overlay, or error panel wrapper. Only intercept and show loading/error states when the user is authenticated (identity is non-null) and attempting to access protected routes before the actor has initialized. This ensures unauthenticated users always see and can interact with the full login UI immediately, regardless of actor initialization state, while still protecting authenticated routes that require the actor to be ready."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Audit and fix useInternetIdentity hook integration in LoginPage, ensuring correct import path, proper destructuring of login function and state values, and a useEffect that triggers role-based navigation after authentication resolves",
      "acceptanceCriteria": [
        "No runtime errors about missing context or undefined hook values on the login page",
        "isLoggingIn correctly reflects true while the Internet Identity popup is open",
        "isAuthenticated transitions to true after the user completes authentication",
        "A useEffect in LoginPage triggers navigation once isAuthenticated is true",
        "InternetIdentityProvider is confirmed present in main.tsx wrapping the root app"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Verify that useInternetIdentity is imported from the immutable path frontend/src/hooks/useInternetIdentity.ts. Ensure the destructured values include login, isLoggingIn (or loginStatus), isAuthenticated (derived from identity), and identity. If login() returns a promise, wrap the onClick handler in an async function that awaits login() before proceeding. Add a useEffect with dependencies [isAuthenticated, identity] that checks if the user is authenticated and then triggers role-based navigation. Handle any errors from login() by catching exceptions and setting local error state to display inline on the page. Confirm that no manual actor checks or initialization guards block the login button. Note: InternetIdentityProvider wrapping is already confirmed in frontend/src/main.tsx (immutable file), so no action is needed there, but document this confirmation in the implementation."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Implement role-based post-login redirect in LoginPage that queries the user's role from the backend and redirects admin to /admin-dashboard, manager to /manager-dashboard, client to /client-dashboard, and others to /dashboard as the safe default",
      "acceptanceCriteria": [
        "Admin users are redirected to /admin-dashboard after successful login",
        "Manager users are redirected to /manager-dashboard after successful login",
        "Client users are redirected to /client-dashboard after successful login",
        "Users with no determined role are redirected to /dashboard",
        "The redirect happens automatically without the user needing to click anything after authentication"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Inside the useEffect that triggers after isAuthenticated becomes true, call the useGetCallerUserRole hook from frontend/src/hooks/useQueries.ts to fetch the authenticated user's role. Wait for the query to resolve. If the role is 'admin' (UserRole.admin), navigate to /admin-dashboard. If the role is 'manager', navigate to /manager-dashboard. If the role is 'client' or 'user', navigate to /client-dashboard. For any other role or if the role query is still loading after a short timeout, redirect to /dashboard as the safe default fallback. Use TanStack Router's useNavigate hook to perform the navigation with { replace: true } to avoid back-button issues. Ensure this logic only runs once per successful authentication by wrapping it in a conditional check or using a ref to track if navigation has already occurred."
        }
      ]
    }
  ]
}