{
  "backend/main.mo": "Motoko canister defining user roles, services, projects, CRM entities, orders, and other business data with access control and in‑memory map-based state.",
  "feature_evidence.json": "Feature evidence report mapping UI/UX requirements to frontend files, components, and associated tests.",
  "frontend-file-summaries.txt": "Human-written summaries describing purposes of all major frontend files in the project.",
  "frontend/index.css": "Base Tailwind and OKLCH variable definitions for theming, including dark mode tokens and global background/foreground styling.",
  "frontend/index.html": "Root HTML entry file containing an empty React mount point and script loader for the main TSX module.",
  "frontend/src/App.tsx": "Main React router setup handling authentication, profile bootstrap logic, and route definitions wrapped in the AppShell layout.",
  "frontend/src/auth/demoCredentials.ts": "Static demo login credentials with a helper function for validating email/password combinations.",
  "frontend/src/auth/useSession.ts": "React hook for storing and restoring demo login session data in sessionStorage.",
  "frontend/src/cart/useCart.ts": "Shopping cart hook with localStorage persistence supporting add, remove, quantity updates, and total calculation.",
  "frontend/src/components/layout/AppShell.tsx": "High-level layout component combining background mesh, sidebar, top navigation, and a scrollable content container.",
  "frontend/src/components/layout/SidebarNav.tsx": "Sidebar navigation component that filters menu items by user role and highlights the active route.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar showing notifications, user info, and logout functionality.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance based on the user's Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for handling Internet Identity authentication and session state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, global styles, and utility classes.",
  "frontend/src/main.tsx": "App entry point that initializes React, QueryClient, and Internet Identity provider.",
  "frontend/src/marketplace/servicesCatalog.ts": "Static list of default service offerings with names and descriptions.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays an analytics dashboard with revenue, clients, conversion rate, and top service stats using card widgets.",
  "frontend/src/pages/AutomationPage.tsx": "Shows a list of automation tools with toggle switches, each described in a card layout.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item management, quantity updates, totals, and navigation to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow by generating Stripe sessions and showing an order summary with GST.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Shows a placeholder onboarding form within a simple card layout.",
  "frontend/src/pages/CRMPage.tsx": "Fetches CRM activities and displays them grouped by sales pipeline stages.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user-specific dashboard metrics like revenue, projects, and orders, with role-based project info.",
  "frontend/src/pages/GeneratorsPage.tsx": "Lists rule-based business generators such as proposals, pricing, and follow-up tools in card format.",
  "frontend/src/pages/LeadsPage.tsx": "Renders lead management UI with lead creation form and CSV export functionality using query hooks.",
  "frontend/src/pages/LegalPage.tsx": "Displays required legal documents and their content, showing placeholders if missing.",
  "frontend/src/pages/LoginPage.tsx": "Handles demo login, Internet Identity auth, and user profile setup flow.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment failure message with navigation options back to cart or dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Lists all orders with amounts and payment statuses using fetched order data.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears cart after successful payment and displays confirmation with navigation links.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Fetches and displays a project's details, including status and service ID.",
  "frontend/src/pages/ProjectsPage.tsx": "Shows a list of projects for the authenticated client or an empty state if none exist.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays service details and tiered pricing, allowing users to add plans to their cart.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all services from backend or defaults, showing tier pricing and links to detail pages.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that shows an access denied message for non-admins and displays a placeholder admin panel card for configuration.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that calls the backend actor to create a Stripe checkout session and validates the returned session URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, radius, fonts, and animations with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the SaaS dashboard goals, constraints, required images, and implemented features."
}