{
  "backend/main.mo": "Main actor defining all types (UserProfile, Service with pricing tiers and settings, Project, Order, Lead, CRMActivity, Offer, Coupon, LegalPage, Notification, GeneratorLog, RazorpayConfig, PaymentLink) and state maps with migration support; includes AccessControl and MixinAuthorization for role-based permissions.",
  "backend/migration.mo": "Migration module that transforms OldService (flat pricing) to NewService structure with category, subcategory, PricingTier objects with features arrays, and ServiceSettings for visibility/availability configuration.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for service settings panel, data editing capabilities, edit button, and useUpdateService mutation hook with high confidence and associated test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including configuration, styling, routing, authentication, cart management, service pages with new structure support, and various dashboard/management pages.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for Quick Bee brand including background, foreground, card, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, Quick Bee Agency title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component with QueryClientProvider, router setup for all pages (dashboard, services, cart, checkout, payments, projects, leads, CRM, automation, analytics, legal, settings, generators, notifications), AppShell layout, and profile setup dialog with Internet Identity integration.",
  "frontend/src/auth/demoCredentials.ts": "Demo credentials definition for Admin, Manager, and Client roles with email/password pairs and validation function returning DemoRole or null.",
  "frontend/src/auth/useSession.ts": "Session management hook storing and retrieving email and DemoRole in sessionStorage with saveSession and clearSession functions.",
  "frontend/src/cart/useCart.ts": "Shopping cart hook with localStorage persistence managing CartItem array (serviceId, serviceName, tier, price, quantity) with add, remove, update, clear operations and total calculation.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Displays error messages during app initialization with retry functionality, supporting both login and app contexts with timeout-specific messaging.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "Guards app rendering during bootstrap, showing loading states with phase-specific messages, error/timeout states with retry, or rendering children when ready.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper that combines SidebarNav and TopNav with a background mesh image and scrollable content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "Left sidebar navigation with role-based menu filtering, active route highlighting, and Quick Bee branding with caffeine.ai attribution footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with notifications popover (unread count badge), user dropdown menu with logout, and notification click navigation to relevant pages.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Toolbar for bulk lead operations showing selection count with buttons for status change, export, delete, and clear selection.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "Modal dialog for bulk updating lead statuses, showing selected leads list and iterating through updates with success/failure toast notifications.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "Modal displaying generated Razorpay payment link with amount, copy-to-clipboard functionality, and external link opening for sharing with leads.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "A dialog component for editing service details including name, description, category, pricing tiers (basic/pro/premium), features, and visibility settings. Uses React Query mutations to update service data and manages complex form state with multiple tabs.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "A settings panel component for configuring Razorpay payment integration with fields for API key, API secret, and webhook secret. Displays configuration status and allows toggling visibility of sensitive credentials.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "A simple hook that tracks whether a bootstrap process has exceeded a 5-second timeout. Provides a reset function to restart the timer.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using @dfinity/auth-client. Manages authentication state, identity persistence, and provides status indicators for the login process.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including user profiles, services, projects, orders, leads, and admin functions. Implements both critical (always-enabled) and lazy-loaded queries with proper actor dependency management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a dark-themed UI using OKLCH color space. Defines teal gradient utilities, glass-panel effects, and consistent color variables for the application.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context. Renders the main App component.",
  "frontend/src/marketplace/servicesCatalog.ts": "Exports a constant array of 30 default service offerings with names and descriptions, covering website development, marketing automation, design, and business tools.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays an analytics dashboard with four metric cards showing revenue, active clients, conversion rate, and top service with static placeholder data.",
  "frontend/src/pages/AutomationPage.tsx": "Renders an automation configuration page with toggleable cards for five automation types (WhatsApp, sequences, proposals, payments, onboarding).",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls, calculates totals with GST, and provides checkout navigation or empty state message.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that creates Stripe checkout sessions from cart items, validates Stripe configuration, and redirects to Stripe payment URL.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Simple placeholder page for client onboarding with a card indicating the onboarding form will appear after project creation.",
  "frontend/src/pages/CRMPage.tsx": "Displays a CRM pipeline with six stage columns (New Lead to Lost), fetching and organizing activities and leads by stage with loading skeletons.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying user profile, role-based metrics (revenue, active projects, orders, conversion rate) with loading states and delayed data fetching.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays a grid of 6 smart generator cards (recommendation, proposal, pricing, script, follow-up, lead scoring) with icons and descriptions. Currently static UI with no click handlers.",
  "frontend/src/pages/LeadsPage.tsx": "Full CRUD interface for managing leads with bulk actions, status changes, payment link generation, and CSV export. Includes forms for creating/editing leads with micro-niche selection, channel tracking, and status management across 7 stages.",
  "frontend/src/pages/LegalPage.tsx": "Displays a grid of 6 required legal document cards (Privacy Policy, Terms, Refund Policy, etc.) showing content preview or 'Not yet created' status. Read-only view fetching from backend.",
  "frontend/src/pages/LoginPage.tsx": "Handles demo credential login with role selection, Internet Identity authentication, and two-step profile setup (name, business name, role). Shows bootstrap error panel if initialization fails.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications in unread/read tabs with mark-as-read functionality and navigation to related pages (leads, projects) based on notification type. Shows icons for different notification types.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple payment failure screen with error icon and buttons to return to cart or dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Tabbed view showing Stripe orders and Razorpay payment links with amounts, statuses, and associated lead/project information. Read-only display of payment transactions.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that clears the cart on mount and provides navigation to projects or dashboard.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays individual project details including status and service ID, fetched by project ID from route params.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays a list of projects for the authenticated client user, fetching data from the backend and showing project status and service ID in card layouts.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed information for a single service including pricing tiers, features, and an admin-only edit button that opens a ServiceEditDialog.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of all visible services in the marketplace with filtering for visibility, featuring badges for featured services, and links to cart and detail pages.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only page that displays system settings including a RazorpayConfigPanel for payment gateway configuration.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that creates a checkout session via the backend actor, passing shopping items and success/cancel URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, typography, and container query plugins.",
  "project_state.json": "Project state tracking document showing implemented features for service settings and editing capabilities, with pending backend extension requirements."
}