{
  "backend/main.mo": "Main backend actor defining all data types (UserProfile, Service, Project, Order, Lead, CRMActivity, Offer, Coupon, LegalPage, Notification, GeneratorLog, RazorpayConfig, PaymentLink) and state maps with CRUD operations, access control integration, and migration support.",
  "backend/migration.mo": "Migration module for canister upgrades, defining OldService and OldActor types to transform data structures during version transitions, particularly for adding Razorpay fields to Service records.",
  "feature_evidence.json": "Feature evidence report documenting four Razorpay integration features: admin UI controls in ServicesPage, ServiceRazorpayDialog component, service detail view display, and checkout flow extension with payment method selection.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including configuration, styling, authentication, pages, components, and hooks with details on Razorpay integration points and role-based access control.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for Quick Bee brand including background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, Quick Bee Agency title, root div, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup defining all routes (dashboard, services, cart, checkout, projects, leads, CRM, analytics, payments, legal, settings, generators, notifications), QueryClient provider, AppShell layout, and profile setup dialog.",
  "frontend/src/auth/demoCredentials.ts": "Demo authentication credentials for Admin, Manager, and Client roles with email/password validation function returning DemoRole or null.",
  "frontend/src/auth/useSession.ts": "React hook that manages user session state (email and role) in sessionStorage with save and clear functions.",
  "frontend/src/cart/useCart.ts": "React hook that manages shopping cart state in localStorage with add, remove, update quantity, clear, and total calculation functions.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Error display component for bootstrap failures with retry button, supporting both login and app contexts with timeout-specific messaging.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "Gate component that manages loading, error, and timeout states during app bootstrap with progressive loading messages and retry functionality.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper component that combines SidebarNav, TopNav, and main content area with background mesh styling.",
  "frontend/src/components/layout/SidebarNav.tsx": "Sidebar navigation component that renders role-filtered menu items with active state highlighting and Caffeine.ai attribution footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with notifications popover (with unread count badge), user dropdown menu, and logout functionality.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Toolbar component for bulk lead operations showing selection count with export, delete, change status, and clear selection actions.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "Dialog component for bulk updating lead statuses, showing selected leads list and handling async updates with success/failure toasts.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "Dialog component for editing payment link URLs and QR codes for leads. Supports generating QR codes via API or uploading custom images, with mutations to update payment link data.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "Dialog component displaying generated payment links with copy, download QR code, and edit functionality. Shows payment amount, link URL, and QR code image with action buttons.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "Dialog form for creating new services with tabbed interface for basic info, three-tier pricing (Basic/Pro/Premium), features, and settings. Includes validation and form state management for all service fields.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "Confirmation dialog for deleting services with warning message and service name display. Handles delete mutation with loading state.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "Dialog form for editing existing services with tabbed interface mirroring the create dialog. Syncs form state with service prop changes and handles update mutations.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "Dialog for editing service payment information including custom payment URLs and QR codes. Supports QR code generation via API or custom image upload with data URL conversion.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "Displays payment information (payment link and QR code) for a service with copy and download functionality. Returns null if no payment info is available.",
  "frontend/src/components/services/ServiceRazorpayDialog.tsx": "Dialog component for configuring Razorpay payment settings for a service, including enable/disable toggle, key ID, and order ID fields with save functionality.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "Settings panel for global Razorpay configuration allowing users to input and save API key, API secret, and webhook secret with show/hide toggle for sensitive data.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Simple watchdog hook that tracks whether a bootstrap process has exceeded a 5-second timeout with reset capability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation and identity state with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for all backend data operations including user profiles, services, projects, orders, leads, payments, and admin functions with mutation handlers.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a dark-themed design system using OKLCH color space, including gradient utilities and glass-panel effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/marketplace/servicesCatalog.ts": "Exports a default catalog of 30 predefined services ranging from web development to automation, each with a name and description.",
  "frontend/src/pages/AnalyticsPage.tsx": "Dashboard page displaying four key business metrics (revenue, active clients, conversion rate, top service) in card components with icons.",
  "frontend/src/pages/AutomationPage.tsx": "Page for managing business automations with toggleable switches for WhatsApp replies, sequence builder, proposal auto-send, payment confirmation, and project onboarding.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page showing cart items with quantity controls, removal options, and order summary with GST calculation and checkout link.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with payment method selection (Stripe/Razorpay), order summary with GST calculation, and payment gateway integration logic.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Placeholder page for client onboarding form that displays after project creation.",
  "frontend/src/pages/CRMPage.tsx": "CRM pipeline page displaying activities organized by sales stages (New Lead, Contacted, Qualified, Proposal Sent, Closed, Lost) with lead name resolution.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying key metrics (revenue, active projects, total orders) with role-based access control and loading states using skeleton components.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays a grid of six smart generator tools (recommendation, proposal, pricing, script, follow-up, lead qualification) with icons and descriptions.",
  "frontend/src/pages/LeadsPage.tsx": "Comprehensive lead management page with CRUD operations, bulk actions, status changes, payment link generation, and support for 50 micro-niches and multiple communication channels.",
  "frontend/src/pages/LegalPage.tsx": "Displays six required legal documents (Privacy Policy, Terms, Refund Policy, etc.) in a grid layout, showing content or placeholder if not created.",
  "frontend/src/pages/LoginPage.tsx": "Handles demo credential authentication with role selection, Internet Identity login, and profile setup flow for new users including name and business name fields.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications in tabbed view (unread/read), supports marking as read, and navigates to relevant pages based on notification type (leads, projects).",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple payment failure page with error icon and navigation buttons to return to cart or dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays payment transactions in tabs: Stripe orders and Razorpay payment links. Allows admins to edit Razorpay payment links and shows associated lead names.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that clears the cart on mount and provides navigation to projects or dashboard.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Shows detailed information for a single project including status and service ID, fetched by project ID from route params.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays all projects for the authenticated client user in a grid layout with service names, status badges, and start dates.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows service details with three pricing tiers (Basic/Pro/Premium), add-to-cart functionality, and admin controls for editing, deleting, and managing payment settings including Razorpay.",
  "frontend/src/pages/ServicesPage.tsx": "Marketplace page listing all services with category and visibility filters, admin controls for creating services and managing payment settings, and displays pricing tiers with featured badges.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that displays Razorpay configuration panel for payment gateway setup.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that creates a Stripe checkout session by calling the backend actor with shopping items and success/cancel URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom animations (accordion), border radius variables, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for a service marketplace application with Razorpay and Stripe payment integration features, documenting existing features for admin payment configuration UI and pending backend requirements for Razorpay service fields and API methods."
}