{
  "backend/main.mo": "Main actor defining all types (UserProfile, Service, Project, Order, Lead, CRMActivity, Offer, Coupon, LegalPage, Notification, GeneratorLog, PaymentLink) and state maps with access control integration; Service and PaymentLink types include optional paymentLinkUrl and qrCodeDataUrl fields.",
  "backend/migration.mo": "Migration module defining old and new type versions for data migration; adds paymentLinkUrl and qrCodeDataUrl fields to Service type during migration from OldService to Service.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for payment link and QR code management in services and payments pages with high confidence ratings and associated test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including configuration, styling, routing, authentication, pages, and hooks; highlights new ServicePaymentInfoDialog, useUpdateServicePaymentInfo mutation, and payment info display components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for Quick Bee brand including sidebar, chart, and UI component colors.",
  "frontend/index.html": "HTML entry point for Quick Bee Agency application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component with TanStack Router setup for all pages, QueryClientProvider, Internet Identity integration, and profile setup dialog; removed bootstrap checks to show LoginPage immediately.",
  "frontend/src/auth/demoCredentials.ts": "Demo credential definitions for Admin, Manager, and Client roles with validation function returning DemoRole or null.",
  "frontend/src/auth/useSession.ts": "Session management hook storing and retrieving email and DemoRole in sessionStorage with saveSession and clearSession functions.",
  "frontend/src/cart/useCart.ts": "Custom React hook for managing shopping cart state with localStorage persistence, supporting add/remove/update operations for service items with tiers and quantities.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Error display component for bootstrap failures with retry functionality, supporting both login and app contexts with timeout-specific messaging.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "Gate component that manages bootstrap loading states, error handling, and timeout detection with progressive loading indicators across different initialization phases.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout wrapper that combines sidebar navigation, top navigation, and content area with background mesh styling.",
  "frontend/src/components/layout/SidebarNav.tsx": "Sidebar navigation component with role-based menu filtering, displaying different navigation items for admin and user roles with active state highlighting.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with notifications popover, user dropdown menu, and logout functionality, including notification badge and mark-as-read capabilities.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Toolbar component for bulk lead operations displaying selected count and action buttons for export, delete, status change, and selection clearing.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "Modal dialog for bulk updating lead statuses, showing selected leads list and handling sequential updates with success/failure tracking.",
  "frontend/src/components/leads/EditPaymentLinkDialog.tsx": "Dialog component for editing payment link URLs and QR codes for leads. Supports generating QR codes via API or uploading custom images, with mutations to update both URL and QR code data.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "Dialog component displaying generated payment links with copy, download QR code, and edit functionality. Shows payment amount, link URL, and QR code image with actions to open external link or edit details.",
  "frontend/src/components/services/ServiceCreateDialog.tsx": "Dialog for creating new services with tabbed interface for basic info, three pricing tiers (Basic/Pro/Premium), general features, and settings. Handles form state for all fields including pricing, features arrays, and visibility settings.",
  "frontend/src/components/services/ServiceDeleteDialog.tsx": "Confirmation dialog for deleting a service with warning message and destructive action button. Uses useDeleteService mutation and displays service name before deletion.",
  "frontend/src/components/services/ServiceEditDialog.tsx": "Dialog for editing existing services with form fields for name, description, category, three pricing tiers with features, and settings. Syncs form state with service prop changes and uses updateService mutation.",
  "frontend/src/components/services/ServicePaymentInfoDialog.tsx": "Dialog for editing service payment information including custom payment URL and QR code. Supports QR code generation from URL via API or custom image upload, with mutation to update service payment details.",
  "frontend/src/components/services/ServicePaymentInfoDisplay.tsx": "React component that displays payment information (payment link and QR code) with copy and download functionality, rendering nothing if no payment data is available.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "Settings panel component for configuring Razorpay API credentials (key, secret, webhook) with visibility toggle and configuration status indicator.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Hook that implements a 5-second timeout watchdog for bootstrap operations with reset capability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for all backend data operations including user profiles, services, projects, orders, leads, CRM activities, offers, coupons, legal pages, notifications, and Razorpay configuration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for dark theme, gradient utilities, and glass-panel styling effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/marketplace/servicesCatalog.ts": "Static catalog of 30 default service offerings with names and descriptions covering web development, marketing, automation, design, and e-commerce services.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays an analytics dashboard with four metric cards showing revenue, active clients, conversion rate, and top service with static placeholder data.",
  "frontend/src/pages/AutomationPage.tsx": "Renders an automation center page with toggleable cards for five automation types (WhatsApp replies, sequence builder, proposal auto-send, payment confirmation, and project onboarding).",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page showing cart items with quantity controls, remove buttons, and order summary with GST calculation; displays empty state when cart is empty.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that creates a Stripe checkout session from cart items, displays order summary with GST, and handles Stripe configuration validation.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Simple client onboarding page with a placeholder card indicating where the onboarding form will appear after project creation.",
  "frontend/src/pages/CRMPage.tsx": "Displays a CRM pipeline with six stages (New Lead to Lost), fetching and organizing CRM activities and leads by stage with skeleton loading states.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying four metric cards (total revenue, active projects, total orders, conversion rate) with data fetched from backend queries and role-based access considerations.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays six smart generator tool cards (service recommendation, proposal generator, pricing strategy, closing script, follow-up messages, lead qualification) as a grid of clickable options.",
  "frontend/src/pages/LeadsPage.tsx": "Main leads management page with CRUD operations, bulk actions, payment link creation, and filtering by micro-niches, channels, and statuses. Includes dialogs for creating/editing leads, bulk status changes, and payment link generation.",
  "frontend/src/pages/LegalPage.tsx": "Displays a grid of required legal documents (Privacy Policy, Terms & Conditions, etc.) fetched from the backend, showing content previews or 'Not yet created' placeholders.",
  "frontend/src/pages/LoginPage.tsx": "Handles demo credential authentication via Internet Identity, validates user roles, and provides a profile setup form for new users to enter name and optional business details.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications in tabs (unread/read), allows marking as read, and navigates to relevant pages (leads/projects) based on notification type with visual icons and badges.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple payment failure screen with an error icon and buttons to return to cart or dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Tabbed view showing Stripe orders and Razorpay payment links with lead associations, amounts, statuses, and an edit dialog for payment links.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that clears the cart on mount and provides navigation to projects or dashboard.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays detailed information for a single project identified by URL parameter, showing status and service ID.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays a list of projects for the authenticated client, showing project ID, status, and service ID in card format with loading skeletons.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed service information with three pricing tiers (Basic, Pro, Premium), admin controls for editing/deleting, and payment info management dialogs.",
  "frontend/src/pages/ServicesPage.tsx": "Marketplace page listing all services with category and visibility filters, admin controls for creating services and editing payment info, and cart integration.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that displays Razorpay payment gateway configuration panel with access control checks.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that creates a checkout session via the backend actor, returning a session ID and redirect URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, typography and container query plugins.",
  "project_state.json": "Project state tracking document showing existing features for payment link/QR code editing and pending feature requests to extend Service model and UI controls."
}