{
  "backend/main.mo": "Main actor defining all types (UserProfile, Service, Project, Order, Lead, CRMActivity, Offer, Coupon, LegalPage, Notification, GeneratorLog, PaymentLink, RazorpayConfig) and state maps with CRUD operations, access control integration, and payment gateway configuration for Stripe and Razorpay.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with a run function to migrate state from old schema to new schema, adding paymentLinks map, nextPaymentLinkId counter, and razorpayConfig field.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: CSV export for leads, Razorpay payment integration with automated workflows, Razorpay configuration panel, and automated notification system for lead status changes.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including configuration, styling, hooks, pages, and components with focus on authentication, payment flows, lead management, notifications, and Razorpay integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme CSS variables for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, Quick Bee Agency title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup for all routes (dashboard, services, cart, checkout, payments, projects, leads, CRM, automation, analytics, legal, settings, generators, notifications), QueryClient provider, authentication flow, profile setup dialog, and bootstrap error handling with retry.",
  "frontend/src/auth/demoCredentials.ts": "Demo credentials definition for Admin, Manager, and Client roles with email/password pairs and validation function returning DemoRole or null.",
  "frontend/src/auth/useSession.ts": "React hook for managing user session state (email and role) in sessionStorage with save and clear methods.",
  "frontend/src/cart/useCart.ts": "React hook for managing shopping cart state in localStorage with add, remove, update quantity, clear, and total calculation methods.",
  "frontend/src/components/bootstrap/BootstrapErrorPanel.tsx": "Error panel component displaying connection errors with retry button, supporting both login and app contexts.",
  "frontend/src/components/bootstrap/BootstrapGate.tsx": "Gate component that manages bootstrap loading, error, and timeout states with a watchdog timer, rendering children only when ready.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout wrapper with background mesh, sidebar navigation, top navigation, and scrollable content area.",
  "frontend/src/components/layout/SidebarNav.tsx": "Sidebar navigation component with role-based menu filtering, active route highlighting, and branding footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with notifications popover, unread badge, user dropdown menu, and logout functionality.",
  "frontend/src/components/leads/BulkActionsToolbar.tsx": "Toolbar for bulk lead operations showing selection count with export, delete, change status, and clear selection actions.",
  "frontend/src/components/leads/BulkStatusChangeDialog.tsx": "Dialog for bulk updating lead statuses, displaying selected leads and executing updates with success/failure feedback.",
  "frontend/src/components/leads/PaymentLinkDialog.tsx": "Dialog displaying generated Razorpay payment link with copy-to-clipboard and open-in-new-tab functionality.",
  "frontend/src/components/settings/RazorpayConfigPanel.tsx": "React component for configuring Razorpay payment gateway credentials (API key, secret, webhook secret) with visibility toggle and configuration status indicator.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance for backend communication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useBootstrapWatchdog.ts": "Custom hook that implements a timeout watchdog (8 seconds) to detect bootstrap failures with reset capability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout with delegation identity management, including AuthClient creation with configurable options and idle handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, services, projects, orders, leads, CRM activities, offers, coupons, legal pages, notifications, and payment links with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for dark theme, gradient utilities, and glass-panel styling effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapping the main App component.",
  "frontend/src/marketplace/servicesCatalog.ts": "Exports a default catalog of 30 digital services with names and descriptions for marketplace offerings (web dev, automation, marketing, design, etc.).",
  "frontend/src/pages/AnalyticsPage.tsx": "Dashboard page displaying business analytics metrics in card format including revenue, active clients, conversion rate, and top service statistics.",
  "frontend/src/pages/AutomationPage.tsx": "Displays a grid of automation toggles (WhatsApp replies, sequences, proposals, payments, onboarding) with switches to enable/disable each automation type.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls, allows removal of items, shows order summary with GST calculation, and provides checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that creates a Stripe checkout session from cart items, displays order summary with GST, and redirects to Stripe payment flow.",
  "frontend/src/pages/ClientOnboardingPage.tsx": "Placeholder page for client onboarding form that will be populated after project creation.",
  "frontend/src/pages/CRMPage.tsx": "Shows a kanban-style CRM pipeline with six stages (New Lead, Contacted, Qualified, Proposal Sent, Closed, Lost) displaying activities grouped by stage.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying key metrics (revenue, active projects, orders, conversion rate) in cards with user greeting and role-based content.",
  "frontend/src/pages/GeneratorsPage.tsx": "Displays a grid of six rule-based business tool generators (service recommendations, proposals, pricing, scripts, follow-ups, lead scoring).",
  "frontend/src/pages/LeadsPage.tsx": "Comprehensive lead management page with CRUD operations, bulk actions, status changes, payment link generation, and support for 50 micro-niches and multiple channels.",
  "frontend/src/pages/LegalPage.tsx": "Displays six required legal documents (Privacy Policy, Terms, Refund Policy, etc.) in a grid, showing content if available or placeholder if not created.",
  "frontend/src/pages/LoginPage.tsx": "Handles user authentication via Internet Identity with demo credentials, role selection, and profile setup flow including name, email, and optional business name fields.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications with filtering (all/unread/read), mark-as-read functionality, and navigation to related pages based on notification type (leads, payments).",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to return to cart or dashboard.",
  "frontend/src/pages/PaymentsPage.tsx": "Shows payment history with tabs for Stripe orders and Razorpay payment links, displaying amounts, statuses, and associated lead/project information.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays payment success confirmation, clears the cart, and provides navigation to projects or dashboard.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Displays detailed information for a single project including status and service ID based on URL parameter.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects for the authenticated client with status and service information, or shows empty state if no projects exist.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows service details with three pricing tiers (Basic, Pro, Premium), their features, and add-to-cart functionality for each tier.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a marketplace grid of services with pricing tiers (Basic/Pro/Premium), fetching from backend or falling back to default catalog, with navigation to cart and individual service detail pages.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that checks user permissions and displays a Razorpay configuration panel for payment gateway setup.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation hook that creates a checkout session via the backend actor, passing shopping items and success/cancel URLs, returning a session with redirect URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with animations, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for QUICK BEE AGENCY OS defining Phase 1 Lead Management CRM with black/teal theme, lead status workflow, existing features (CSV export, Razorpay integration, notifications, bulk actions), and pending feature requests."
}