{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add editable payment link and QR code options in Services",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add UI controls in ServicesPage to allow editing payment links and QR codes for each service item",
      "acceptanceCriteria": [
        "Each service card or row displays an action button to edit payment information",
        "Clicking the edit action opens a dialog similar to EditPaymentLinkDialog",
        "The dialog allows users to input/update payment link URLs",
        "The dialog supports QR code generation via backend API or custom image upload"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/services/ServicePaymentInfoDialog.tsx",
          "operation": "create",
          "description": "Create a dialog component for editing service payment information (payment link URL and QR code). Follow the pattern established by EditPaymentLinkDialog in frontend/src/components/leads/EditPaymentLinkDialog.tsx. Support both QR code generation via backend API call and custom image upload with data URL conversion. Include form fields for paymentLinkUrl and qrCodeDataUrl with validation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Add an edit payment info action button to each service card displayed to admin users. Wire the button to open ServicePaymentInfoDialog passing the current service data. Ensure the dialog only appears for admin users using the authorization component's access control."
        },
        {
          "path": "frontend/src/pages/ServiceDetailPage.tsx",
          "operation": "modify",
          "description": "Add admin-only edit button for payment information in the service detail view. Wire it to open ServicePaymentInfoDialog with the current service's payment data. Ensure proper authorization checks using the authorization component before showing the edit option."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create React Query mutations for updating service payment links and QR codes",
      "acceptanceCriteria": [
        "useUpdateServicePaymentLink mutation calls backend to update paymentLinkUrl",
        "useUpdateServiceQRCode mutation calls backend to update qrCodeDataUrl",
        "Mutations invalidate the services query cache on success",
        "Error handling displays appropriate feedback to users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useUpdateServicePaymentInfo mutation hook that calls actor.updateServicePaymentInfo with service id, paymentLinkUrl, and qrCodeDataUrl parameters. On success, invalidate both 'services' and individual service query caches. Include error handling with user-friendly messages for authorization failures and validation errors. Follow the existing mutation patterns in this file for consistency."
        },
        {
          "path": "frontend/src/components/services/ServicePaymentInfoDialog.tsx",
          "operation": "modify",
          "description": "Wire the ServicePaymentInfoDialog to use the useUpdateServicePaymentInfo mutation from useQueries.ts. Handle loading, success, and error states appropriately with toast notifications or inline error messages. Close the dialog on successful mutation and show appropriate feedback to the user."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update ServiceDetailPage to display payment link and QR code if available",
      "acceptanceCriteria": [
        "Service detail page shows payment link URL if configured",
        "Service detail page displays QR code image if configured",
        "Admin users see an edit button to modify payment information",
        "Copy and download options are available for payment links and QR codes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/services/ServicePaymentInfoDisplay.tsx",
          "operation": "create",
          "description": "Create a component that displays service payment information including payment link URL (with copy button) and QR code image (with download button) when available. Show a well-formatted section that only renders when paymentLinkUrl or qrCodeDataUrl fields are present on the service. Include utility functions for copying text to clipboard and downloading QR code images."
        },
        {
          "path": "frontend/src/pages/ServiceDetailPage.tsx",
          "operation": "modify",
          "description": "Add ServicePaymentInfoDisplay component to the service detail page layout below the pricing tiers section. Pass the service's paymentLinkUrl and qrCodeDataUrl as props. Ensure the display section only appears when at least one payment field is configured. The edit button for admin users was already added in REQ-1."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure PaymentsPage displays editable payment links with the existing EditPaymentLinkDialog functionality",
      "acceptanceCriteria": [
        "Payment links in PaymentsPage show an edit icon or button",
        "Clicking edit opens EditPaymentLinkDialog with current values",
        "Users can update payment link URL and QR code",
        "Changes persist to backend and refresh the payment links list"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PaymentsPage.tsx",
          "operation": "modify",
          "description": "Verify that each payment link row in the Razorpay payment links tab displays an edit button that opens EditPaymentLinkDialog with the current payment link data. Ensure the dialog uses the existing useSetPaymentLinkUrl and useSetPaymentLinkQRCode mutations from useQueries.ts. Confirm that the payment links query cache is properly invalidated after successful updates. The EditPaymentLinkDialog component already exists at frontend/src/components/leads/EditPaymentLinkDialog.tsx and should be reused without modification."
        }
      ]
    }
  ]
}