{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add settings and data editing for services in marketplace",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a settings panel for each service in the marketplace that allows administrators to configure service-specific settings including visibility, featured status, availability, and custom metadata",
      "acceptanceCriteria": [
        "Settings panel is accessible from the service detail page for admin users",
        "Settings include toggles for service visibility and featured status",
        "Settings are persisted in the backend Service data structure",
        "Changes to settings are immediately reflected in the marketplace view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/services/ServiceSettingsPanel.tsx",
          "operation": "create",
          "description": "Create a settings panel component that displays service visibility toggle, featured status toggle, availability dropdown, and custom metadata text field. Use the authorization component to ensure only admin users can view and edit these settings. Include form state management and wire to the useUpdateService mutation hook for persistence."
        },
        {
          "path": "frontend/src/pages/ServiceDetailPage.tsx",
          "operation": "modify",
          "description": "Import ServiceSettingsPanel and conditionally render it for admin users using isCallerAdmin query. Position the panel below the service details section. Ensure the panel is hidden for non-admin users."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement data editing capabilities for service details including title, description, pricing tiers (Basic, Pro, Premium), features list, and category information",
      "acceptanceCriteria": [
        "Admin users can edit service title, description, and category",
        "Each pricing tier (Basic, Pro, Premium) can be individually edited with price and features",
        "Validation ensures required fields are populated before saving",
        "Edit interface shows current values and provides feedback on successful updates",
        "Changes are reflected immediately in the ServicesPage marketplace view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/services/ServiceEditDialog.tsx",
          "operation": "create",
          "description": "Create a comprehensive edit dialog component with form sections for service details (name, description, category, subcategory) and pricing tiers (Basic, Pro, Premium). Each pricing tier includes price input and feature list editor. Include form validation for required fields (name, description, category) and price values. Use Dialog, Input, Textarea, and Button components from shadcn/ui. Wire to useUpdateService mutation with loading states and success/error feedback using toast notifications."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an 'Edit Service' button on the ServiceDetailPage that opens an edit dialog for administrators to modify service data and settings",
      "acceptanceCriteria": [
        "Edit button is visible only to admin users on ServiceDetailPage",
        "Button opens a modal dialog with form fields for all editable service properties",
        "Dialog includes tabs or sections for 'Details' and 'Settings'",
        "Save button commits changes via backend mutation",
        "Cancel button discards changes and closes dialog"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ServiceDetailPage.tsx",
          "operation": "modify",
          "description": "Import ServiceEditDialog component and add an 'Edit Service' button in the header section that is conditionally rendered for admin users only (using isCallerAdmin query). Add state to manage dialog open/close. Pass the current service data to the dialog component. Position the button prominently near the service title."
        },
        {
          "path": "frontend/src/components/services/ServiceEditDialog.tsx",
          "operation": "modify",
          "description": "Enhance the ServiceEditDialog to include tabbed sections using Tabs component from shadcn/ui. Create 'Details' tab containing service name, description, category, subcategory, pricing tiers, and features. Create 'Settings' tab containing visibility toggle, featured status toggle, availability dropdown, and custom metadata field. Implement Cancel button that closes dialog without saving and Save button that validates and submits via useUpdateService mutation."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create a useUpdateService mutation hook in useQueries.ts that calls the backend updateService function and invalidates the services query cache on success",
      "acceptanceCriteria": [
        "Hook follows the pattern of existing mutation hooks in useQueries.ts",
        "Mutation invalidates 'services' and individual service queries on success",
        "Hook handles loading and error states appropriately",
        "Success callback triggers toast notification confirming the update"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useUpdateService mutation hook that accepts service ID and updated service data (name, description, category, subcategory, pricing tiers, features, settings). Call actor.updateService with the provided parameters. On success, invalidate both ['services'] query key and ['service', serviceId] query key to refresh marketplace and detail views. Include onSuccess callback that displays a success toast notification. Handle loading and error states following existing mutation patterns in the file."
        }
      ]
    }
  ]
}