{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add editable payment checkout and Razorpay options in service marketplace",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add UI controls in ServicesPage.tsx to allow admins to configure Razorpay payment options for each service",
      "acceptanceCriteria": [
        "Admin users can access Razorpay configuration controls from the service marketplace",
        "The UI provides clear options to enable/disable Razorpay for individual services",
        "Changes to Razorpay settings are persisted to the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Add a 'Configure Razorpay' button next to existing payment info edit controls in the service cards for admin users. Wire this button to open the new ServiceRazorpayDialog component. Ensure the button is only visible when user has admin role using isCallerAdmin check."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create ServiceRazorpayDialog component for editing Razorpay settings per service",
      "acceptanceCriteria": [
        "Dialog displays current Razorpay configuration for the selected service",
        "Users can toggle Razorpay enabled/disabled state",
        "Users can input and save Razorpay key ID",
        "Dialog integrates with existing service update mutation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/services/ServiceRazorpayDialog.tsx",
          "operation": "create",
          "description": "Create a dialog component similar to ServicePaymentInfoDialog that allows editing Razorpay configuration. Include a toggle for razorpayEnabled (boolean), input field for razorpayKeyId (optional Text), and optional orderId field. Use the updateServiceRazorpay backend method from useQueries. Display current values from the service prop and handle form state management. Include cancel and save buttons with mutation handling."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useUpdateServiceRazorpay mutation hook that calls actor.updateServiceRazorpay(id, enabled, keyId, orderId). Also add useGetServiceRazorpayConfig query hook that calls actor.getServiceRazorpayConfig(id) to fetch current Razorpay configuration for a service. Include proper query invalidation for 'services' after mutation success."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Display Razorpay payment option status in ServiceDetailPage.tsx with edit controls for admins",
      "acceptanceCriteria": [
        "Service detail page shows Razorpay enabled/disabled badge",
        "Admin users see an 'Edit Razorpay' button next to payment info controls",
        "Button opens ServiceRazorpayDialog with current service context"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ServiceDetailPage.tsx",
          "operation": "modify",
          "description": "Add a Razorpay status badge below the payment info section showing 'Razorpay: Enabled' or 'Razorpay: Disabled' based on service.razorpayEnabled. For admin users, add an 'Edit Razorpay Settings' button that opens ServiceRazorpayDialog with the current service as context. Import and wire the ServiceRazorpayDialog component with dialog open state management."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Extend CheckoutPage.tsx to support Razorpay as alternative payment method when enabled",
      "acceptanceCriteria": [
        "Checkout page detects if any cart items have Razorpay enabled",
        "Users see payment method selection (Stripe/Razorpay) when Razorpay is available",
        "Razorpay payment flow initiates correctly with proper order details",
        "Fallback to Stripe-only when no services have Razorpay enabled"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Add logic to detect if any services in the cart have razorpayEnabled set to true by fetching all cart service IDs and checking their Razorpay status. If Razorpay is available for any item, display a payment method selector (radio buttons or tabs) allowing users to choose between Stripe and Razorpay. When Razorpay is selected, integrate Razorpay checkout flow using the service's razorpayKeyId and generate appropriate order details. Maintain existing Stripe checkout as default when Razorpay is not enabled or not selected. Use isRazorpayConfigured backend method to verify global Razorpay configuration before showing the option."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useIsRazorpayConfigured query hook that calls actor.isRazorpayConfigured() to check if Razorpay is globally configured. This supports the checkout page's decision on whether to display Razorpay as a payment option."
        }
      ]
    }
  ]
}